
v = .c~c
say .c~c~items
i = .c~new
say i~c~items
v~append((5,6))

say .c~c~items
say .c~new~c~items

say i~c~items

::Class C
::Constant C ((1,2),(3,4))