Do; !Options = DefaultString Text; Call !Options !Options; Options !Options; End
var = (!DS("🦀")) || (Bytes("🦞"))
Say (!DS('"'))var||(!DS('" is a')) StringType(var) (!DS("string of length")) !Length(var)

::Requires 'Unicode.cls'
