/* launchee */
/* This file is deemed to be stored on the download directory of the SD card */
/* launcher.rexx calls it */
PARSE ARG arg
SAY "I say" arg
