//USZCZT0P  JOB (AD00),'#07B42 ZELDEN',                                         
//             NOTIFY=&SYSUID,                                                  
//             CLASS=M,MSGCLASS=H,MSGLEVEL=(1,1)                                
//*                                                                             
//*JOBPARM SYSAFF=????                                                          
//*                                                                             
//*****************************************************************             
//*  GLOBALLY CHANGE SYS1PK TO DESIRED ONEPAK VOLSER                            
//*  GLOBALLY CHANGE TARGSYS TO DESIRED SSA (NEED ALTER ACCESS)                 
//*  GLOBALLY CHANGE SYS1.ICFCAT.MSTRDRVR TO DRIVER SYS MCAT NAME               
//*****************************************************************             
//*  REVIEW ALL PARMLIB, PROCLIB & VTAMLST MEMBERS (STEPS 15-17)                
//*  - CONSOL00 AND LCL3270A ADDRESSES MUST MATCH LOCAL 3270 CONFIG             
//*  - LOAD00 MUST HAVE A VALID OS CONFIG ID AND EDT CONFIG ID                  
//*  - CHECK SPOOLDEF IN JES2PARM FOR CORRECT 5 CHAR. VOLUME PREFIX             
//*****************************************************************             
//* THE ONEPAK SYSTEM INCLUDES (AT LEAST) THE FOLLOWING PRODUCTS                
//* (IN ADDITION TO Z/OS BCP AND DFSMS): JES2, TSO/E, RACF, VTAM,               
//*  ISPF, SDSF, ICKDSF, HCD, LE, HLASM, FDR, AND SYNCSORT.                     
//*                                                                             
//*  A 3390-3 MAY BE REQUIRED TO FIT THE SYSTEM ON A SINGLE VOLUME.             
//*  YOU MAY BE ABLE TO USE A 3390-2 OR 3380-K DEPENDING ON THE                 
//*  SIZE OF YOUR RACF DATA SETS, IODF DSN, HOW BIG YOU ALLOCATE                
//*  YOUR SPOOL AND LOCAL PAGE DATA SET, AND BY NOT INCLUDING                   
//*  SYS1.MACLIB AND SYS1.MODGEN.                                               
//*****************************************************************             
//*                                                                             
//*   THE FOLLOWING STEPS COPY THE RUNNING SYSTEM TO SYS1PK AND ......          
//*                                                                             
//*  1.  DEFINE MASTER CATALOG AND SSA                                          
//*  2.  ALLOCATE RACF DSNS                                                     
//*  3.  REPRO COPY RACF DSNS                                                   
//*  4.  DEFINE PAGE DATA SETS, SMF DATASETS, AND VIO DSN                       
//*  5.  FORMAT SMF DATASETS                                                    
//*  6.  FDRCOPY THE CURRENT/RUNNING SYSTEM TO SYS1PK AND CATLG DSNS            
//*  7.  ZAP RACF DATA SET NAME TABLE                                           
//*  8.  PUT IPL TEXT ON IPL VOLUME USING ICKDSF                                
//*  9.  ALLOCATE NEW LOGREC, BRODCAST, SPOOL AND CKPT DSNS                     
//* 10.  RENAME NEW LOGREC, BRODCAST, SPOOL AND CKPT DSNS                       
//* 11.  CATALOG NEW LOGREC, BRODCAST, SPOOL AND CKPT DSNS                      
//* 12.  INITIALIZE LOGREC                                                      
//* 13.  RENAME ALL OTHER DSNS TO REMOVE SSA                                    
//* 14.  COMPRESS SYS1.PARMLIB ON SYS1PK                                        
//* 15.  UPDATE PARMLIB WITH REQUIRED MEMBERS                                   
//* 16.  UPDATE PROCLIB WITH REQUIRED MEMBERS                                   
//* 17.  UPDATE VTAMLST WITH REQUIRED MEMBERS                                   
//* 18.  UPDATE SISPCLIB WITH REQUIRED MEMBERS                                  
//* 19.  UPDATE SISPPENU WITH REQUIRED MEMBERS                                  
//* 20.  LIST THE SYS1PK MASTER CATALOG                                         
//* 21.  CLEANUP - REMOVE SSA AND EXPORT DISCONNECT SYS1PK MCAT                 
//*                                                                             
//* AFTER THE FIRST IPL:                                                        
//* 1) REPLY "FORMAT,NOREQ" TO JES2 STARTUP OPTION  (MSG $HASP426)              
//* 2) LOGON TO TSO BY USING "LOGON APPLID(TSO)" FROM VTAM TERMINAL             
//* 3) FROM TSO READY OR ISPF OPT. 6 ISSUE THE SYNC COMMAND TO                  
//*    FORMAT THE BRODCAST DATASET. IF USING UADS, BE SURE TO FIRST             
//*    "ALLOC FI(SYSUADS)" THEN "SYNC BOTH", OTHERWISE "SYNC RACF".             
//*                                                                             
//*****************************************************************             
//* CHANGES FROM Z/OS 1.3 VERSION FOR Z/OS 1.6:                                 
//* 1. DEL SEUVFLPA AND REPLACE WITH SEUVLPA in COPY / LPALST00                 
//* 2. DEL SEUVFLNK AND REPLACE WITH SEUVLINK in COPY / PROG00                  
//* 3. ADD SEAGALT  to COPY / ALTER / LPALST00                                  
//* 4. ADD SIEALNKE to COPY / ALTER / LNKLST and APF in PROG00                  
//* 5. REMOVE ILM PARMS FROM IEASYS00                                           
//*****************************************************************             
//* CHANGES FROM Z/OS 1.6 VERSION FOR Z/OS 1.8:                                 
//* 1. DEL REFERENCES TO SISPSASC (1.8 CHANGE)                                  
//*  (Add to COPY/ALTER/LNKLST/APF to use this sample for z/OS 1.7)             
//* 2. DEL SHASLINK AND REPLACE WITH SHASLNKE (1.7 CHANGE)                      
//* 3. ADD SIEAMIGE TO COPY/ALTER/LNKLST/APF IN PROG00 (1.7 CHANGE)             
//* 4. REMOVE RDINUM= AND RELADDR= FROM JES2PARM (1.7 CHANGE)                   
//*****************************************************************             
//* DEFINE MASTER CATALOG AND SSA                                               
//*****************************************************************             
//MCATSSA1  EXEC  PGM=IDCAMS,REGION=4M                                          
//SYSPRINT  DD    SYSOUT=*                                                      
//SYSIN     DD    *                                                             
 EXP SYS1.MCAT.VSYS1PK DISCONNECT                                               
 IF LASTCC=12 THEN SET MAXCC=0                                                  
 DEF MCAT(NAME(SYS1.MCAT.VSYS1PK) VOL(SYS1PK) -                                 
     STORCLAS(SCNONSMS) -                                                       
     CYL(3 1) ICFCAT -                                                          
     SHR(3 4) STRNO(3) BUFND(4)  BUFNI(4)  FSPC(10 10)) -                       
     DATA( CISZ(4096)) -                                                        
     CAT(SYS1.ICFCAT.MSTRDRVR)    /* CHANGE */                                  
 IF LASTCC=0 THEN DO                                                            
   DEF ALIAS(NAME(TARGSYS) RELATE(SYS1.MCAT.VSYS1PK)) -                         
     CAT(SYS1.ICFCAT.MSTRDRVR)    /* CHANGE */                                  
 END                                                                            
/*                                                                              
//*****************************************************************             
//* ALLOCATE RACF DSNS                                                          
//*****************************************************************             
//RACFALC2 EXEC PGM=IEFBR14,REGION=4M,COND=(0,NE)                               
//RACFPRIM DD  DSN=TARGSYS.SYS1.RACF.PRIMARY,                                   
//             DISP=(NEW,CATLG,DELETE),                                         
//             UNIT=SYSALLDA,VOL=SER=SYS1PK,                                    
//             SPACE=(CYL,(300),,CONTIG),                                       
//             STORCLAS=SCNONSMS,  /* CAN'T USE WITH DSORG=PSU */               
//             DCB=(DSORG=PS,RECFM=F,LRECL=4096,BLKSIZE=4096)                   
//*            DCB=(DSORG=PSU,RECFM=F,LRECL=4096,BLKSIZE=4096)                  
//RACFBKUP DD  DSN=TARGSYS.SYS1.RACF.BACKUP,                                    
//             DISP=(NEW,CATLG,DELETE),                                         
//             UNIT=SYSALLDA,VOL=SER=SYS1PK,                                    
//             SPACE=(CYL,(300),,CONTIG),                                       
//             STORCLAS=SCNONSMS,  /* CAN'T USE WITH DSORG=PSU */               
//             DCB=(DSORG=PS,RECFM=F,LRECL=4096,BLKSIZE=4096)                   
//*            DCB=(DSORG=PSU,RECFM=F,LRECL=4096,BLKSIZE=4096)                  
//*****************************************************************             
//* REPRO COPY RACF DSNS                                                        
//*****************************************************************             
//RACFCPY3  EXEC  PGM=IDCAMS,REGION=4M,COND=(0,NE)                              
//SYSPRINT DD  SYSOUT=*                                                         
//IN1      DD  DSN=SYS1.RACF.LOCAL.PRIMARY,DISP=SHR                             
//IN2      DD  DSN=SYS1.RACF.LOCAL.BACKUP,DISP=SHR                              
//OUT1     DD  DSN=TARGSYS.SYS1.RACF.PRIMARY,DISP=SHR                           
//OUT2     DD  DSN=TARGSYS.SYS1.RACF.BACKUP,DISP=SHR                            
//SYSIN    DD  *                                                                
  REPRO INFILE(IN1) OUTFILE(OUT1)                                               
  REPRO INFILE(IN2) OUTFILE(OUT2)                                               
/*                                                                              
//*****************************************************************             
//* DEFINE PAGE DATA SETS, SMF DATASETS, AND VIO DSN                            
//*****************************************************************             
//PAGSMFV4  EXEC  PGM=IDCAMS,REGION=4M,COND=(0,NE)                              
//SYSPRINT  DD    SYSOUT=*                                                      
//SYSIN     DD    *                                                             
 DEF PGSPC(NAME(TARGSYS.SYS1.PAGE.VSYS1PK.PLPA) -                               
     STORCLAS(SCNONSMS) -                                                       
     VOL(SYS1PK) CYLINDERS(85))                                                 
 DEF PGSPC(NAME(TARGSYS.SYS1.PAGE.VSYS1PK.COMMON) -                             
     STORCLAS(SCNONSMS) -                                                       
     VOL(SYS1PK) CYLINDERS(25))                                                 
 DEF PGSPC(NAME(TARGSYS.SYS1.PAGE.VSYS1PK.LOCAL) -                              
     STORCLAS(SCNONSMS) -                                                       
     VOL(SYS1PK) CYLINDERS(200))                                                
 DEF CL (CISZ(4096) CYLINDERS(25) -                                             
     STORCLAS(SCNONSMS) -                                                       
     NAME(TARGSYS.SYS1.VSYS1PK.MAN1) NIXD RECSZ(4086,32767)-                    
     REUSE SHR(2) SPANNED SPEED VOL(SYS1PK)) -                                  
     DATA (NAME(TARGSYS.SYS1.VSYS1PK.MAN1.DATA))                                
 DEF CL (CISZ(4096) CYLINDERS(25) -                                             
     STORCLAS(SCNONSMS) -                                                       
     NAME(TARGSYS.SYS1.VSYS1PK.MAN2) NIXD RECSZ(4086,32767)-                    
     REUSE SHR(2) SPANNED SPEED VOL(SYS1PK)) -                                  
     DATA (NAME(TARGSYS.SYS1.VSYS1PK.MAN2.DATA))                                
 DEF CL (BUFSP(20480) CYL(5)             -                                      
     STORCLAS(SCNONSMS) -                                                       
     KEYS(12,8) NAME(TARGSYS.SYS1.VSYS1PK.STGINDEX) -                           
     RECSZ(2041,2041) REUSE VOL(SYS1PK)) -                                      
     DATA(CISZ(2048)) INDEX(CISZ(4096))                                         
/*                                                                              
//*****************************************************************             
//* FORMAT SMF DATASETS                                                         
//*****************************************************************             
//SMFFMT5 EXEC  PGM=IFASMFDP,REGION=4M,COND=(0,NE)                              
//SYSPRINT DD  SYSOUT=*                                                         
//MAN1     DD  DSN=TARGSYS.SYS1.VSYS1PK.MAN1,DISP=SHR                           
//MAN2     DD  DSN=TARGSYS.SYS1.VSYS1PK.MAN2,DISP=SHR                           
//SYSIN    DD  *                                                                
   INDD(MAN1,OPTIONS(CLEAR))                                                    
   INDD(MAN2,OPTIONS(CLEAR))                                                    
/*                                                                              
//*****************************************************************             
//* FDRCOPY THE CURRENT/RUNNING SYSTEM TO SYS1PK AND CATLG DSNS                 
//*****************************************************************             
//COPY6    EXEC PGM=FDRCOPY,REGION=4M,COND=(0,NE)                               
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
 COPY     TYPE=DSF,DSNENQ=NONE,ENQERR=NO                                        
 SELECT   CATDSN=SYS1.IODF53.CLUSTER,NEWI=+TARGSYS,NVOL=SYS1PK,                 
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.CMDLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                         
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.DAE,NEWI=+TARGSYS,NVOL=SYS1PK,                            
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.HELP,NEWI=+TARGSYS,NVOL=SYS1PK,                           
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.IMAGELIB,NEWI=+TARGSYS,NVOL=SYS1PK,                       
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.LINKLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                        
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.MIGLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                         
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.CSSLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                         
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.SIEALNKE,NEWI=+TARGSYS,NVOL=SYS1PK,                       
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.SIEAMIGE,NEWI=+TARGSYS,NVOL=SYS1PK,                       
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.LPALIB,NEWI=+TARGSYS,NVOL=SYS1PK,                         
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.MACLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                         
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.MODGEN,NEWI=+TARGSYS,NVOL=SYS1PK,                         
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.NUCLEUS,NEWI=+TARGSYS,NVOL=SYS1PK,                        
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.SHASLNKE,NEWI=+TARGSYS,NVOL=SYS1PK,                       
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.SHASMIG,NEWI=+TARGSYS,NVOL=SYS1PK,                        
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.SCNMLPA1,NEWI=+TARGSYS,NVOL=SYS1PK,                       
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.SASMMOD1,NEWI=+TARGSYS,NVOL=SYS1PK,                       
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.PARMLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                        
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.PROCLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                        
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.SAMPLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                        
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.SISTCLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                       
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.SVCLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                         
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.CEE.SCEERUN,NEWI=+TARGSYS,NVOL=SYS1PK,                    
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.VTAMLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                        
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.UADS,NEWI=+TARGSYS,NVOL=SYS1PK,                           
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.VTAMLST,NEWI=+TARGSYS,NVOL=SYS1PK,                        
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.SCBDCLST,NEWI=+TARGSYS,NVOL=SYS1PK,                       
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.SCBDPENU,NEWI=+TARGSYS,NVOL=SYS1PK,                       
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.SCBDMENU,NEWI=+TARGSYS,NVOL=SYS1PK,                       
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.SCBDTENU,NEWI=+TARGSYS,NVOL=SYS1PK,                       
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.SCBDHENU,NEWI=+TARGSYS,NVOL=SYS1PK,                       
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.SDWWDLPA,NEWI=+TARGSYS,NVOL=SYS1PK,                       
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.REXX.SEAGALT,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.EUV.SEUVLPA,NEWI=+TARGSYS,NVOL=SYS1PK,                    
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.EUV.SEUVLINK,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISF.SISFEXEC,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISF.SISFLINK,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISF.SISFLOAD,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISF.SISFLPA,NEWI=+TARGSYS,NVOL=SYS1PK,                    
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISF.SISFMLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISF.SISFPLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISF.SISFSLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISF.SISFTLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISF.HASPINDX.TEST,NEWI=+TARGSYS,NVOL=SYS1PK,              
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISP.SISPCLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISP.SISPEXEC,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISP.SISPLOAD,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISP.SISPLPA,NEWI=+TARGSYS,NVOL=SYS1PK,                    
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISP.SISPMENU,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISP.SISPPENU,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISP.SISPSENU,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISP.SISPSLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.ISP.SISPTENU,NEWI=+TARGSYS,NVOL=SYS1PK,                   
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.IBM.PROCLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                    
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS1.IBM.PARMLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                    
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYSV.FDR.LINKLIB,NEWI=+TARGSYS,NVOL=SYS1PK,                    
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYSV.SYNCSORT.ZOS.SYNCLPA,NEWI=+TARGSYS,NVOL=SYS1PK,           
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYSV.SYNCSORT.ZOS.SYNCRENT,NEWI=+TARGSYS,NVOL=SYS1PK,          
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYSV.SYNCSORT.ZOS.SYNCAUTH,NEWI=+TARGSYS,NVOL=SYS1PK,          
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYSV.SYNCSORT.ZOS.SYNCLINK,NEWI=+TARGSYS,NVOL=SYS1PK,          
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS2.LOCAL.LPALIB,                                             
             NEWN=TARGSYS.SYS1.VSYS1PK.LPALIB,NVOL=SYS1PK,                      
             STORCLAS=SCNONSMS                                                  
 SELECT   CATDSN=SYS2.LOCAL.LINKLIB,                                            
             NEWN=TARGSYS.SYS1.VSYS1PK.LINKLIB,NVOL=SYS1PK,                     
             STORCLAS=SCNONSMS                                                  
/*                                                                              
//*****************************************************************             
//* ZAP RACF DATA SET NAME TABLE TO DISABLE SYSPLEX MODE                        
//* AND CHANGE PRIMARY DATA SET NAME To SYS1.RACF.PRIMARY                       
//* AND CHANGE BACKUP  DATA SET NAME TO SYS1.RACF.BACKUP                        
//*****************************************************************             
//RACFZAP7  EXEC PGM=AMASPZAP,PARM=IGNIDRFULL,REGION=4M,COND=(0,NE)             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSLIB   DD  DSN=TARGSYS.SYS1.VSYS1PK.LINKLIB,DISP=SHR                        
//SYSIN    DD  *                                                                
NAME ICHRDSNT ICHRDSNT                                                          
REP 005A 80                                                                     
REP 0001 E2,E8E2                                                                
REP 0004 F14B,D9C1,C3C6,4BD7,D9C9,D4C1,D9E8                                     
REP 0012 4040                                                                   
REP 0014 4040,4040,4040,4040,4040,4040                                          
REP 0020 4040,4040,4040,4040,4040,4040,40                                       
REP 002D E2,E8E2                                                                
REP 0030 F14B,D9C1,C3C6,4BC2,C1C3,D2E4,D740                                     
REP 003E 4040                                                                   
REP 0040 4040,4040,4040,4040,4040,4040                                          
REP 004C 4040,4040,4040,4040,4040,4040,40                                       
/*                                                                              
//*****************************************************************             
//* PUT IPL TEXT ON IPL VOLUME USING ICKDSF                                     
//*****************************************************************             
//IPLTEXT8 EXEC PGM=ICKDSF,PARM=NOREPLYU,REGION=4M,COND=(0,NE)                  
//SYSPRINT DD  SYSOUT=*                                                         
//IPLTEXT  DD  DISP=SHR,VOL=SER=SYS1PK,UNIT=SYSALLDA,                           
//             DSN=TARGSYS.SYS1.SAMPLIB(IPLRECS)                                
//         DD  DISP=SHR,VOL=SER=SYS1PK,UNIT=SYSALLDA,                           
//             DSN=TARGSYS.SYS1.SAMPLIB(IEAIPL00)                               
//SYSIN    DD  *                                                                
   REFORMAT  DDNAME(IPLTEXT)                                     -              
             IPLDD(IPLTEXT)                                      -              
             NOVERIFY                                            -              
             BOOTSTRAP   /* IPLRECS OF IPLTEXT DD WILL SUPPLY IT */             
/*                                                                              
//*****************************************************************             
//* ALLOCATE NEW LOGREC, BRODCAST, SPOOL AND CKPT DSNS                          
//*****************************************************************             
//ALLOC9   EXEC  PGM=IEFBR14,COND=(0,NE)                                        
//LOGREC   DD  DISP=(NEW,KEEP),DSN=TARGSYS.SYS1.VSYS1PK.LOGREC,                 
//             VOL=SER=SYS1PK,UNIT=SYSALLDA,                                    
//             STORCLAS=SCNONSMS,                                               
//             SPACE=(CYL,1)                                                    
//HASPCKPT DD  DISP=(NEW,KEEP),DSN=TARGSYS.SYS1.VSYS1PK.HASPCKPT,               
//             VOL=SER=SYS1PK,UNIT=SYSALLDA,                                    
//             STORCLAS=SCNONSMS,                                               
//             SPACE=(CYL,5)                                                    
//HASPACE  DD  DISP=(NEW,KEEP),DSN=TARGSYS.SYS1.VSYS1PK.HASPACE,                
//             VOL=SER=SYS1PK,UNIT=SYSALLDA,                                    
//             STORCLAS=SCNONSMS,                                               
//             SPACE=(CYL,100)                                                  
//BRODCAST DD  DISP=(NEW,KEEP),DSN=TARGSYS.SYS1.BRODCAST,                       
//             VOL=SER=SYS1PK,UNIT=SYSALLDA,                                    
//             STORCLAS=SCNONSMS,                                               
//             SPACE=(CYL,5)                                                    
//*****************************************************************             
//* RENAME NEW LOGREC, BRODCAST, SPOOL AND CKPT DSNS                            
//*****************************************************************             
//RENAME10 EXEC  PGM=IEHPROGM,REGION=4M,COND=(0,NE)                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYS1PK   DD  DISP=OLD,VOL=SER=SYS1PK,UNIT=SYSALLDA                            
//SYSIN    DD  *                                                                
 RENAME VOL=SYSDA=SYS1PK,DSNAME=TARGSYS.SYS1.VSYS1PK.LOGREC,           X        
               NEWNAME=SYS1.VSYS1PK.LOGREC                                      
 RENAME VOL=SYSDA=SYS1PK,DSNAME=TARGSYS.SYS1.VSYS1PK.HASPCKPT,         X        
               NEWNAME=SYS1.VSYS1PK.HASPCKPT                                    
 RENAME VOL=SYSDA=SYS1PK,DSNAME=TARGSYS.SYS1.VSYS1PK.HASPACE,          X        
               NEWNAME=SYS1.VSYS1PK.HASPACE                                     
 RENAME VOL=SYSDA=SYS1PK,DSNAME=TARGSYS.SYS1.BRODCAST,                 X        
               NEWNAME=SYS1.BRODCAST                                            
/*                                                                              
//*****************************************************************             
//* CATALOG NEW LOGREC, BRODCAST, SPOOL AND CKPT DSNS                           
//*****************************************************************             
//CATLG11   EXEC  PGM=IDCAMS,REGION=4M,COND=(0,NE)                              
//SYSPRINT  DD    SYSOUT=*                                                      
//SYSIN     DD    *                                                             
 DEF NVSAM(NAME(SYS1.VSYS1PK.LOGREC)   VOL(SYS1PK) DEVT(3390)) -                
    CAT(SYS1.MCAT.VSYS1PK)                                                      
 DEF NVSAM(NAME(SYS1.VSYS1PK.HASPACE)  VOL(SYS1PK) DEVT(3390)) -                
    CAT(SYS1.MCAT.VSYS1PK)                                                      
 DEF NVSAM(NAME(SYS1.VSYS1PK.HASPCKPT) VOL(SYS1PK) DEVT(3390)) -                
    CAT(SYS1.MCAT.VSYS1PK)                                                      
 DEF NVSAM(NAME(SYS1.BRODCAST)         VOL(SYS1PK) DEVT(3390)) -                
    CAT(SYS1.MCAT.VSYS1PK)                                                      
/*                                                                              
//*****************************************************************             
//* INITIALIZE LOGREC                                                           
//*****************************************************************             
//LOGREC12  EXEC  PGM=IFCDIP00,REGION=4M,COND=(0,NE)                            
//SERERDS   DD DISP=SHR,DSN=SYS1.VSYS1PK.LOGREC,                                
//             VOL=SER=SYS1PK,UNIT=SYSALLDA                                     
//*****************************************************************             
//* RENAME ALL OTHER DSNS TO REMOVE SSA                                         
//*****************************************************************             
//RENAME13  EXEC  PGM=IDCAMS,REGION=4M,COND=(0,NE)                              
//SYSPRINT  DD    SYSOUT=*                                                      
//SYSIN     DD    *                                                             
 ALTER TARGSYS.SYS1.RACF.PRIMARY -                                              
   NEWNAME(SYS1.RACF.PRIMARY) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.RACF.BACKUP -                                               
   NEWNAME(SYS1.RACF.BACKUP) -                                                  
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.PAGE.VSYS1PK.PLPA -                                         
   NEWNAME(SYS1.PAGE.VSYS1PK.PLPA) -                                            
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.PAGE.VSYS1PK.PLPA.DATA -                                    
   NEWNAME(SYS1.PAGE.VSYS1PK.PLPA.DATA) -                                       
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.PAGE.VSYS1PK.COMMON -                                       
   NEWNAME(SYS1.PAGE.VSYS1PK.COMMON) -                                          
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.PAGE.VSYS1PK.COMMON.DATA -                                  
   NEWNAME(SYS1.PAGE.VSYS1PK.COMMON.DATA) -                                     
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.PAGE.VSYS1PK.LOCAL -                                        
   NEWNAME(SYS1.PAGE.VSYS1PK.LOCAL) -                                           
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.PAGE.VSYS1PK.LOCAL.DATA -                                   
   NEWNAME(SYS1.PAGE.VSYS1PK.LOCAL.DATA) -                                      
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.VSYS1PK.MAN1 -                                              
   NEWNAME(SYS1.VSYS1PK.MAN1) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.VSYS1PK.MAN1.DATA -                                         
   NEWNAME(SYS1.VSYS1PK.MAN1.DATA) -                                            
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.VSYS1PK.MAN2 -                                              
   NEWNAME(SYS1.VSYS1PK.MAN2) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.VSYS1PK.MAN2.DATA -                                         
   NEWNAME(SYS1.VSYS1PK.MAN2.DATA) -                                            
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.VSYS1PK.STGINDEX -                                          
   NEWNAME(SYS1.VSYS1PK.STGINDEX) -                                             
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.VSYS1PK.STGINDEX.DATA -                                     
   NEWNAME(SYS1.VSYS1PK.STGINDEX.DATA) -                                        
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.VSYS1PK.STGINDEX.INDEX -                                    
   NEWNAME(SYS1.VSYS1PK.STGINDEX.INDEX) -                                       
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.IODF53.CLUSTER -                                            
   NEWNAME(SYS1.IODF00.CLUSTER) -                                               
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.IODF53 -                                                    
   NEWNAME(SYS1.IODF00) -                                                       
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.CMDLIB -                                                    
   NEWNAME(SYS1.CMDLIB) -                                                       
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.DAE -                                                       
   NEWNAME(SYS1.DAE) -                                                          
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.HELP -                                                      
   NEWNAME(SYS1.HELP) -                                                         
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.IMAGELIB -                                                  
   NEWNAME(SYS1.IMAGELIB) -                                                     
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.LINKLIB -                                                   
   NEWNAME(SYS1.LINKLIB) -                                                      
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.MIGLIB -                                                    
   NEWNAME(SYS1.MIGLIB) -                                                       
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.CSSLIB -                                                    
   NEWNAME(SYS1.CSSLIB) -                                                       
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.SIEALNKE -                                                  
   NEWNAME(SYS1.SIEALNKE) -                                                     
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.SIEAMIGE -                                                  
   NEWNAME(SYS1.SIEAMIGE) -                                                     
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.LPALIB -                                                    
   NEWNAME(SYS1.LPALIB) -                                                       
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.MACLIB -                                                    
   NEWNAME(SYS1.MACLIB) -                                                       
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.MODGEN -                                                    
   NEWNAME(SYS1.MODGEN) -                                                       
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.NUCLEUS -                                                   
   NEWNAME(SYS1.NUCLEUS) -                                                      
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.SHASLNKE -                                                  
   NEWNAME(SYS1.SHASLNKE) -                                                     
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.SHASMIG -                                                   
   NEWNAME(SYS1.SHASMIG) -                                                      
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.SCNMLPA1 -                                                  
   NEWNAME(SYS1.SCNMLPA1) -                                                     
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.SASMMOD1 -                                                  
   NEWNAME(SYS1.SASMMOD1) -                                                     
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.PARMLIB -                                                   
   NEWNAME(SYS1.PARMLIB) -                                                      
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.PROCLIB -                                                   
   NEWNAME(SYS1.PROCLIB) -                                                      
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.SAMPLIB -                                                   
   NEWNAME(SYS1.SAMPLIB) -                                                      
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.SISTCLIB -                                                  
   NEWNAME(SYS1.SISTCLIB) -                                                     
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.SVCLIB -                                                    
   NEWNAME(SYS1.SVCLIB) -                                                       
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.CEE.SCEERUN -                                               
   NEWNAME(SYS1.CEE.SCEERUN) -                                                  
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.VTAMLIB -                                                   
   NEWNAME(SYS1.VTAMLIB) -                                                      
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.UADS -                                                      
   NEWNAME(SYS1.UADS) -                                                         
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.VTAMLST -                                                   
   NEWNAME(SYS1.VTAMLST) -                                                      
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.SCBDCLST -                                                  
   NEWNAME(SYS1.SCBDCLST) -                                                     
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.SCBDPENU -                                                  
   NEWNAME(SYS1.SCBDPENU) -                                                     
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.SCBDMENU -                                                  
   NEWNAME(SYS1.SCBDMENU) -                                                     
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.SCBDTENU -                                                  
   NEWNAME(SYS1.SCBDTENU) -                                                     
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.SCBDHENU -                                                  
   NEWNAME(SYS1.SCBDHENU) -                                                     
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.SDWWDLPA -                                                  
   NEWNAME(SYS1.SDWWDLPA) -                                                     
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.REXX.SEAGALT -                                              
   NEWNAME(SYS1.REXX.SEAGALT) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.EUV.SEUVLPA -                                               
   NEWNAME(SYS1.EUV.SEUVLPA) -                                                  
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.EUV.SEUVLINK -                                              
   NEWNAME(SYS1.EUV.SEUVLINK) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISF.SISFEXEC -                                              
   NEWNAME(SYS1.ISF.SISFEXEC) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISF.SISFLINK -                                              
   NEWNAME(SYS1.ISF.SISFLINK) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISF.SISFLOAD -                                              
   NEWNAME(SYS1.ISF.SISFLOAD) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISF.SISFLPA -                                               
   NEWNAME(SYS1.ISF.SISFLPA) -                                                  
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISF.SISFMLIB -                                              
   NEWNAME(SYS1.ISF.SISFMLIB) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISF.SISFPLIB -                                              
   NEWNAME(SYS1.ISF.SISFPLIB) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISF.SISFSLIB -                                              
   NEWNAME(SYS1.ISF.SISFSLIB) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISF.SISFTLIB -                                              
   NEWNAME(SYS1.ISF.SISFTLIB) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISF.HASPINDX.TEST -                                         
   NEWNAME(SYS1.ISF.HASPINDX) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISP.SISPCLIB -                                              
   NEWNAME(SYS1.ISP.SISPCLIB) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISP.SISPEXEC -                                              
   NEWNAME(SYS1.ISP.SISPEXEC) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISP.SISPLOAD -                                              
   NEWNAME(SYS1.ISP.SISPLOAD) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISP.SISPLPA -                                               
   NEWNAME(SYS1.ISP.SISPLPA) -                                                  
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISP.SISPMENU -                                              
   NEWNAME(SYS1.ISP.SISPMENU) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISP.SISPPENU -                                              
   NEWNAME(SYS1.ISP.SISPPENU) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISP.SISPSENU -                                              
   NEWNAME(SYS1.ISP.SISPSENU) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISP.SISPSLIB -                                              
   NEWNAME(SYS1.ISP.SISPSLIB) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.ISP.SISPTENU -                                              
   NEWNAME(SYS1.ISP.SISPTENU) -                                                 
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.IBM.PROCLIB -                                               
   NEWNAME(SYS1.IBM.PROCLIB) -                                                  
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.IBM.PARMLIB -                                               
   NEWNAME(SYS1.IBM.PARMLIB) -                                                  
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYSV.FDR.LINKLIB -                                               
   NEWNAME(SYS1.FDR.LINKLIB) -                                                  
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYSV.SYNCSORT.ZOS.SYNCLPA -                                      
   NEWNAME(SYS1.SYNCSORT.ZOS.SYNCLPA) -                                         
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYSV.SYNCSORT.ZOS.SYNCRENT -                                     
   NEWNAME(SYS1.SYNCSORT.ZOS.SYNCRENT) -                                        
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYSV.SYNCSORT.ZOS.SYNCAUTH -                                     
   NEWNAME(SYS1.SYNCSORT.ZOS.SYNCAUTH) -                                        
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYSV.SYNCSORT.ZOS.SYNCLINK -                                     
   NEWNAME(SYS1.SYNCSORT.ZOS.SYNCLINK) -                                        
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.VSYS1PK.LPALIB -                                            
   NEWNAME(SYS1.VSYS1PK.LPALIB) -                                               
     CAT(SYS1.MCAT.VSYS1PK)                                                     
 ALTER TARGSYS.SYS1.VSYS1PK.LINKLIB -                                           
   NEWNAME(SYS1.VSYS1PK.LINKLIB) -                                              
     CAT(SYS1.MCAT.VSYS1PK)                                                     
/*                                                                              
//*****************************************************************             
//* COMPRESS SYS1.PARMLIB ON SYS1PK                                             
//*****************************************************************             
//COMP14     EXEC PGM=IEBCOPY,REGION=4M,COND=(0,NE)                             
//SYSPRINT DD  SYSOUT=*                                                         
//IN1      DD  DISP=SHR,DSN=SYS1.PARMLIB,                                       
//             UNIT=SYSALLDA,VOL=SER=SYS1PK                                     
//SYSUT3   DD  UNIT=SYSALLDA,SPACE=(CYL,(10,5))                                 
//SYSUT4   DD  UNIT=SYSALLDA,SPACE=(CYL,(10,5))                                 
//SYSIN    DD  *                                                                
  COPY INDD=IN1,OUTDD=IN1,LIST=NO                                               
/*                                                                              
//*****************************************************************             
//* UPDATE PARMLIB WITH REQUIRED MEMBERS                                        
//*****************************************************************             
//UPARM15  EXEC PGM=IEBUPDTE,PARM=NEW,REGION=4M,COND=(0,NE)                     
//SYSUT2   DD  DSN=SYS1.PARMLIB,DISP=SHR,                                       
//             UNIT=SYSALLDA,VOL=SER=SYS1PK                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DATA,DLM=@#                                                      
./ ADD NAME=CLOCK00,LEVEL=00,SOURCE=0,LIST=ALL                                  
OPERATOR NOPROMPT                                                               
TIMEZONE W.05.00.00                                                             
ETRMODE  NO                                                                     
ETRZONE  NO                                                                     
ETRDELTA 10                                                                     
./ ADD NAME=COFVLF00,LEVEL=00,SOURCE=0,LIST=ALL                                 
/*Start of specifications ********************************************/         
/*                                                                   */         
/*  Name: COFVLF00                                                   */         
/*                                                                   */         
/*  Descriptive Name: Virtual Lookaside Facility (VLF)               */         
/*                    default SYS1.PARMLIB member                    */         
/*                                                                   */         
/*  Copyright =                                                      */         
/*        5685-001                                                   */         
/*        This macro is "RESTRICTED MATERIALS OF IBM"                */         
/*        (C) Copyright IBM Corporation 1988                         */         
/*        Licensed materials - Property of IBM                       */         
/*                                                                   */         
/*  Status: JBB3311                                                  */         
/*                                                                   */         
/*  Function:                                                        */         
/*    COFVLF00 specifies the VLF CLASS and Major Name used for       */         
/*    objects stored by Library Lookaside (LLA). The class       @P2C*/         
/*    of objects is named "CSVLLA" with a single major name of   @P1C*/         
/*    "LLA".                                                         */         
/*                                                                   */         
/*  Change activity:                                                 */         
/*    $L0=VLF     HBB3310 871023 PDAM: Virtual Lookaside Facility    */         
/*    $P1=VLF     HBB3310 880209 PDAM: Change LLA class name         */         
/*    $P2=PCG0085 JBB3311 880419 PDAM: Library Lookaside name        */         
/*                                                                   */         
/*End of Specifications **********************************************/         
CLASS NAME(CSVLLA)           /* Class name for Library Lookaside @P2C*/         
      EMAJ(LLA)              /* Major name for Library Lookaside @P2C*/         
                             /*                                      */         
CLASS NAME(IRRGTS)           /* CLASS NAME FOR RACF 1.9 GTS          */         
      EMAJ(GTS)              /* MAJOR NAME OF IRRGTS class           */         
                             /*                                      */         
CLASS NAME(IRRACEE)          /* RACF 1.9.2 ACEE Data in Memory       */         
      EMAJ(ACEE)             /* Major name = ACEE                    */         
                             /*                                      */         
./ ADD NAME=COMMND00,LEVEL=00,SOURCE=0,LIST=ALL                                 
COM='S VLF,SUB=MSTR'                                                            
COM='DD ADD,VOL=SYS1PK'                                                         
COM='DD NAME=SYS1.&SYSNAME..DMP&SEQ'                                            
COM='DD ALLOC=ACTIVE'                                                           
COM='S IRRDPTAB'                                                                
COM='SETLOGRC IGNORE'                                                           
COM='S NET'                                                                     
COM='S SDSF'                                                                    
COM='S TSO'                                                                     
./ ADD NAME=CONSOL00,LEVEL=00,SOURCE=0,LIST=ALL                                 
INIT     AMRF(N) CMDDELIM(;) MLIM(3000) MMS(NO) MONITOR(DSNAME)                 
         RLIM(9999)                                                             
DEFAULT HOLDMODE(NO) RMAX(9999) ROUTCODE(ALL)                                   
HARDCOPY DEVNUM(SYSLOG)                                                         
         ROUTCODE(ALL)                                                          
         CMDLEVEL(CMDS)                                                         
/********************************************************************/          
/* MASTER AND ALTERNATE CONSOLES                                    */          
/********************************************************************/          
CONSOLE DEVNUM(120)  ROUTCODE(ALL)  /* MASTER - 0120 */                         
        ALTERNATE(720)                                                          
        AUTH(MASTER)                                                            
        AREA(NONE)                                                              
        UNIT(3270-X)                                                            
        NAME(MASTER)                                                            
        MSCOPE(*)                                                               
        CMDSYS(*)                                                               
        MONITOR(JOBNAMES-T,SESS-T)                                              
        CON(N) DEL(RD) RNUM(20) RTME(1/4) MFORM(J,T,S)                          
        SEG(20)                                                                 
CONSOLE DEVNUM(720)  ROUTCODE(ALL)  /* ALTERNATE - 0720 */                      
        ALTERNATE(120)                                                          
        AUTH(ALL)                                                               
        AREA(NONE)                                                              
        UNIT(3270-X)                                                            
        NAME(ALT)                                                               
        MSCOPE(*)                                                               
        CMDSYS(*)                                                               
        MONITOR(JOBNAMES-T,SESS-T)                                              
        CON(N) DEL(RD) RNUM(20) RTME(1/4) MFORM(J,T,S)                          
        SEG(20)                                                                 
/********************************************************************/          
/* SUBSYS CONSOLES                                                  */          
/********************************************************************/          
CONSOLE DEVNUM(SUBSYSTEM) NAME(SUB1)  AUTH(ALL)                                 
CONSOLE DEVNUM(SUBSYSTEM) NAME(SUB2)  AUTH(ALL)                                 
./ ADD NAME=COUPLE00,LEVEL=00,SOURCE=0,LIST=ALL                                 
 COUPLE SYSPLEX(LOCAL)                                                          
./ ADD NAME=DEVSUP00,LEVEL=00,SOURCE=0,LIST=ALL                                 
COMPACT=YES,                                                                    
VOLNSNS=YES                                                                     
./ ADD NAME=GRSCNF00,LEVEL=00,SOURCE=0,LIST=ALL                                 
    GRSDEF                                                                      
            RESMIL(10)                                                          
            TOLINT(180)                                                         
            ACCELSYS(99)                                                        
         /* RESTART(YES)       - Defaulted */                                   
         /* REJOIN(YES)        - Defaulted */                                   
         /* CTRACE(CTIGRS00)   - Defaulted */                                   
./ ADD NAME=IEACMD00,LEVEL=00,SOURCE=0,LIST=ALL                                 
COM='CHNGDUMP SET,SDUMP=(LSQA,TRT,XESDATA),ADD'                                 
COM='SET SLIP=00'                                                               
COM='SET DAE=01'                                                                
COM='START LLA,SUB=MSTR'                                                        
COM='START BLSJPRMI,SUB=MSTR'                                                   
./ ADD NAME=IEAFIX00,LEVEL=00,SOURCE=0,LIST=ALL                                 
INCLUDE LIBRARY(SYS1.LPALIB)                                                    
MODULES(IEFBR14)                                                                
./ ADD NAME=IEALPA00,LEVEL=00,SOURCE=0,LIST=ALL                                 
INCLUDE  LIBRARY (SYS1.VSYS1PK.LINKLIB)                                         
 MODULES(ICHRDSNT,ICHRFR01,ICHRRCDE,ICHRIN03)                                   
./ ADD NAME=IEAOPT00,LEVEL=00,SOURCE=0,LIST=ALL                                 
CNTCLIST=YES,                                                                   
ERV=5000                                                                        
./ ADD NAME=IEAPAK00,LEVEL=00,SOURCE=0,LIST=ALL                                 
(IEFBR14)                                                                       
./ ADD NAME=IEASVC00,LEVEL=00,SOURCE=0,LIST=ALL                                 
SVCPARM 245,REPLACE,TYPE(3)                   /* SYNCSORT */                    
./ ADD NAME=IEASYM00,LEVEL=00,SOURCE=0,LIST=ALL                                 
SYSDEF   SYSCLONE(00)                 /* SYSTEM CLONE                */         
         SYSNAME(EMRG)                /* SYSTEM NAME                 */         
         SYSPARM(00,L)                /* USE IEASYS00                */         
./ ADD NAME=IEASYS00,LEVEL=00,SOURCE=0,LIST=ALL                                 
CMB=(UNITR,COMM,GRAPH,CHRDR), ADDITIONAL CMB ENTRIES                            
CON=(00,NOJES3),              CONSOLE MEMBER - CONSOL00                         
COUPLE=00,                    COUPLE00                                          
CLOCK=00,                     CLOCK00                                           
CLPA,                         CLPA                                              
CMD=(00,L),                   COMMND00                                          
CSA=(2048,80000),             SIZE IN K FOR CSA                                 
DEVSUP=00,                    DEVSUP00                                          
DIAG=00,                      DIAG00                                            
DUMP=(DASD),                  PLACE SVC DUMPS ON DASD DEVICES                   
FIX=00,                       IEAFIX00                                          
GRS=NONE,                     NO GRS                                            
GRSCNF=00,                    GRSCNF00                                          
LICENSE=Z/OS,                 LICENSE Z/OS                                      
LNKAUTH=LNKLST,               LNKLST IS APF AUTHORIZED                          
LOGCLS=L,                     SYSOUT L FOR PRINT OF SYSLOG                      
LOGLMT=999999,                MAXIMUM WTL MESSAGES QUEUED                       
LOGREC=SYS1.VSYS1PK.LOGREC,   LOGREC DSN                                        
LPA=(00,L),                   LPALST00                                          
MAXUSER=300,                  MAXIMUM # ADDRESS SPACES                          
MLPA=(00,L),                  IEALPA00                                          
MSTRJCL=(00,L),               MSTJCL00                                          
OMVS=DEFAULT,                 NO BPXPRMXX - OMVS IN MIN MODE                    
OPI=YES,                      ALLOW OPERATOR OVERRIDE TO IEASYS00               
OPT=00,                       IEAOPT00                                          
PAGE=(SYS1.PAGE.VSYS1PK.PLPA,          PLPA PAGE DATA SET                       
      SYS1.PAGE.VSYS1PK.COMMON,        COMMON PAGE DATA SET                     
      SYS1.PAGE.VSYS1PK.LOCAL,L),      LOCAL PAGE DATA SET                      
PAK=00,                       IEAPAK00                                          
PLEXCFG=XCFLOCAL,             SYSPLEX CONFIG                                    
PROD=00,                      IFAPRD00 SPECIFIED                                
PROG=(00,L),                  PROG00 - APF LIST AND LNKLST                      
REAL=0,                       V=R SIZE                                          
RSU=00,                       NO RECONFIG STORAGE UNITS                         
RSVNONR=50,                   RESERVED ASIDS FOR NON-REUSABLE                   
RSVSTRT=10,                   RESERVED ASIDS FOR START                          
SMF=00,                       SMFPRM00                                          
SMS=NA,                       IGDSMSNA (DOES NOT EXIST ON PURPOSE)              
SQA=(15,200),                 SIZE IN 64K INCREMENTS FOR SQA                    
SSN=(00),                     IEFSSN00                                          
SVC=00,                       IEASVC00                                          
VAL=00,                       VATLST00                                          
VIODSN=SYS1.VSYS1PK.STGINDEX, VIO DSN                                           
VRREGN=0                      DEFAULT REAL-STORAGE REGION SIZE                  
./ ADD NAME=IEFSSN00,LEVEL=00,SOURCE=0,LIST=ALL                                 
SUBSYS SUBNAME(JES2) /* JES2 AS PRIMARY SUBSYSTEM */                            
  PRIMARY(YES) START(YES)                                                       
SUBSYS SUBNAME(RACF) INITRTN(IRRSSI00) INITPARM('RACF,M')                       
./ ADD NAME=IFAPRD00,LEVEL=00,SOURCE=0,LIST=ALL                                 
/* =========== IBM LICENSING TERMS & CONDITIONS NOTICE =========== */           
/*                                                                  */          
/* THIS IFAPRD00 MEMBER HAS BEEN CUSTOMIZED BY IBM TO REFLECT THE   */          
/* IBM PRODUCTS AND OPTIONAL INTEGRATED FEATURES SPECIFICALLY       */          
/* ORDERED BY YOU.                                                  */          
/*                                                                  */          
/* THE PRODUCTS AND OPTIONAL FEATURES WHICH WERE ORDERED HAVE BEEN  */          
/* 'ENABLED' IN THIS MEMBER.  THOSE OPTIONAL FEATURES, WHICH WERE   */          
/* NOT ORDERED BUT SHIPPED TO YOU AS A PART OF THE INTEGRATED       */          
/* PRODUCT, HAVE BEEN 'DISABLED'.                                   */          
/*                                                                  */          
/* CHANGES TO THE 'ENABLED' OR 'DISABLED' STATE OF ANY OF THE IBM   */          
/* PRODUCTS AND OPTIONAL FEATURES PROVIDED IN THIS MEMBER MUST BE   */          
/* DONE IN ACCORDANCE WITH IBM'S LICENSING TERMS AND CONDITIONS AS  */          
/* DESCRIBED IN SUCH PRODUCT'S LICENSED PROGRAM SPECIFICATIONS AND  */          
/* THE TERMS AND CONDITIONS FOR OS/390 DESCRIBED IN "OS/390         */          
/* LICENSED PROGRAM SPECIFICATIONS" GC28-1728.  SEE "Z/OS MVS       */          
/* PRODUCT MANAGEMENT" GC28-1730 FOR ADDITIONAL INFORMATION.        */          
/*                                                                  */          
/* ================================================================ */          
/*                                                                  */          
/* CHANGE ACTIVITY:                                                 */          
/*   OS/390   : - Dynamic Enablement support was introduced         */          
/*                since OS/390. For detailed information            */          
/*                on using dynamic enablement, please refer         */          
/*                to "Planning for Installation" GC28-1726.         */          
/*   z/OS V1R1: - Changes required:                                 */          
/*                ID(5647-0A1) changed to ID(5694-A01))             */          
/*                NAME(OS/390) changed to NAME('z/OS')              */          
/*                                                                  */          
/*   z/OS V1R2: - Changes required:                                 */          
/*                1. DFSORT became exclusive in z/OS V1R2           */          
/*                2. SOMobjects ADE was no longer an element, it    */          
/*                   has been removed from this list.               */          
/*                                                                  */          
/*   z/OS V1R3: - Changes required:                                 */          
/*                1. Added program number for z/OS.e                */          
/*                   ID(5655-G52) - NAME remains as ('z/OS')        */          
/*                                                                  */          
/* ================================================================ */          
   WHEN (HWNAME(*))                                                             
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('z/OS')                                                     
        STATE(ENABLED)                                                          
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('TCP/IP BASE')                                              
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('TCP/IP CICS')                                              
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('TCP/IP IMS')                                               
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(DFSMSDSS)                                                   
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(DFSMSHSM)                                                   
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(DFSMSRMM)                                                   
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(GDDM-REXX)                                                  
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(JES3)                                                       
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('BOOKMGR BUILD')                                            
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(BDTFTF)                                                     
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(BDTNJE)                                                     
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('C/C++/DEBUG')                                              
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('C/C++')                                                    
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(DFSORT)                                                     
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(GDDM-PGF)                                                   
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME(GDDM-PGF)                                                          
        ID(5668-812)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(GDDM-PGF)                                                   
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('TOOLKIT DEBUGGER')                                         
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('HI LVL ASSEMBLER')                                                
        ID(5696-234)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('TOOLKIT DEBUGGER')                                         
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('SECURITY SERVER')                                          
        STATE(ENABLED)                                                          
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(RMF)                                                        
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(SDSF)                                                       
        STATE(ENABLED)                                                          
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('HCM')                                                      
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5694-A01)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('INFOPRINT SERVER')                                         
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('IBM VAJAVA/390')                                                  
        ID(5655-JAV)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(VAJAVA-DEBUG)                                               
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('IBM VAPLI/390')                                                   
        ID(5655-B22)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(VAPL/I-DEBUG)                                               
        STATE(DISABLED)                                                         
/*  This section of IFAPRD is provided for the z/OS.e product.      */          
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('z/OS')                                                     
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('TCP/IP BASE')                                              
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('TCP/IP CICS')                                              
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('TCP/IP IMS')                                               
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(DFSMSDSS)                                                   
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(DFSMSHSM)                                                   
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(DFSMSRMM)                                                   
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(JES3)                                                       
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(BDTNJE)                                                     
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('C/C++/DEBUG')                                              
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('C/C++')                                                    
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(DFSORT)                                                     
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('TOOLKIT DEBUGGER')                                         
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('SECURITY SERVER')                                          
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(RMF)                                                        
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME(SDSF)                                                       
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('HCM')                                                      
        STATE(DISABLED)                                                         
PRODUCT OWNER('IBM CORP')                                                       
        NAME('z/OS')                                                            
        ID(5655-G52)                                                            
        VERSION(*) RELEASE(*) MOD(*)                                            
        FEATURENAME('INFOPRINT SERVER')                                         
        STATE(DISABLED)                                                         
./ ADD NAME=IKJTSO00,LEVEL=00,SOURCE=0,LIST=ALL                                 
AUTHCMD NAMES(          /* AUTHORIZED COMMANDS      */      +                   
   AD       ADDSD       /* RACF COMMANDS            */ +                        
   AG       ADDGROUP    /*                          */ +                        
   AU       ADDUSER     /*                          */ +                        
   ALG      ALTGROUP    /*                          */ +                        
   ALD      ALTDSD      /*                          */ +                        
   ALU      ALTUSER     /*                          */ +                        
   BLKUPD               /*                          */ +                        
   CO       CONNECT     /*                          */ +                        
   DD       DELDSD      /*                          */ +                        
   DG       DELGROUP    /*                          */ +                        
   DU       DELUSER     /*                          */ +                        
   LD       LISTDSD     /*                          */ +                        
   LG       LISTGRP     /*                          */ +                        
   LU       LISTUSER    /*                          */ +                        
   RACDCERT             /*                          */ +                        
   RALT     RALTER      /*                          */ +                        
   RACLINK              /*                          */ +                        
   RDEF     RDEFINE     /*                          */ +                        
   RDEL     RDELETE     /*                          */ +                        
   RE       REMOVE      /*                          */ +                        
   RL       RLIST       /*                          */ +                        
   RVARY                /*                          */ +                        
   PASSWORD PW          /*                          */ +                        
   PE       PERMIT      /*                          */ +                        
   SETR     SETROPTS    /*                          */ +                        
   SR       SEARCH      /*                          */ +                        
   IRRDPI00             /*                          */ +                        
   MVPXDISP             /* IP COMMAND               */ +                        
   TRACERTE             /* IP COMMAND               */ +                        
   RECEIVE              /* TSO COMMANDS             */ +                        
   TRANSMIT XMIT        /*                          */ +                        
   CONSPROF           /* ICSF COMMAND             */ +                          
   RACONVRT CONSPROF    /*                          */ +                        
   LISTB    LISTBC      /*                          */ +                        
   LISTD    LISTDS      /*                          */ +                        
   SE       SEND        /*                          */ +                        
   SYNC                 /*                          */ +                        
   TESTAUTH TESTA       /*                          */ +                        
   PARMLIB  IKJPRMLB    /*                          */ +                        
   IEBCOPY              /*                          */ +                        
   BINDDATA BDATA       /*  DMSMS COMMANDS          */ +                        
   LISTDATA LDATA       /*                          */ +                        
   SETCACHE SETC        /*                          */)                         
                        /*                          */                          
AUTHPGM NAMES(          /* AUTHORIZED PROGRAMS      */      +                   
   ICHUT100             /*                          */ +                        
   ICHUT200             /*                          */ +                        
   ICHUT400             /*                          */ +                        
   ICHDSM00             /*                          */ +                        
   IRRDSC00             /*                          */ +                        
   IRRUT100             /*                          */ +                        
   IRRUT200             /*                          */ +                        
   IRRUT400             /*                          */ +                        
   IRRDPI00             /*                          */ +                        
   GIMSMP               /* SMPE                     */ +                        
   IOEGRWAG           /* DFS                      */ +                          
   IOENEWAG           /* DFS                      */ +                          
   IOESALVG           /* DFS                      */ +                          
   IOEBAK             /* DFS                      */ +                          
   IOEBOS             /* DFS                      */ +                          
   IOECM              /* DFS                      */ +                          
   IOEDCEER           /* DFS                      */ +                          
   IOEDFSXP           /* DFS                      */ +                          
   IOEFTS             /* DFS                      */ +                          
   IOEMAPID           /* DFS                      */ +                          
   IOESCOUT           /* DFS                      */ +                          
   IOEUDBG            /* DFS                      */ +                          
   IOEAGFMT           /* DFS                      */ +                          
   IOEAGSLV           /* DFS                      */ +                          
   IOEZADM            /* DFS                      */ +                          
   ICADCT             /* FIREWALL                 */ +                          
   ICADDCT            /* FIREWALL                 */ +                          
   ICADCFGS           /* FIREWALL                 */ +                          
   ICADPFTP           /* FIREWALL                 */ +                          
   ICADFTPD           /* FIREWALL                 */ +                          
   ICADSLOG           /* FIREWALL                 */ +                          
   ICADSOCK           /* FIREWALL                 */ +                          
   ICADSOXD           /* FIREWALL                 */ +                          
   ICADSTAK           /* FIREWALL                 */ +                          
   ICADIKED           /* FIREWALL                 */ +                          
   IEBCOPY              /*                          */ +                        
   CSFDAUTH           /* ICSF PGM                 */)                           
                        /*                          */                          
NOTBKGND NAMES(         /* COMMANDS WHICH MAY NOT BE */  +                      
                        /* ISSUED IN THE BACKGROUND  */  +                      
   OPER     OPERATOR    /*                           */ +                       
   TERM     TERMINAL    /*                           */)                        
                        /*                           */                         
AUTHTSF NAMES(          /* PROGRAMS TO BE AUTHORIZED */  +                      
                        /* WHEN CALLED THROUGH THE   */  +                      
                        /* TSO SERVICE FACILITY.     */  +                      
   GIMSMP               /* SMPE                     */ +                        
   ICQASLI0             /*                          */ +                        
   IKJEFF76             /*                          */ +                        
   IEBCOPY              /*                          */ +                        
   CSFDAUTH             /* ICSF SF                  */)                         
                        /*                           */                         
SEND                    /* SEND COMMAND DEFAULTS     */  +                      
   OPERSEND(ON)         /*                           */ +                       
   USERSEND(ON)         /*                           */ +                       
   SAVE(ON)             /*                           */ +                       
   CHKBROD(OFF)         /*                           */ +                       
   LOGNAME(SYS1.BRODCAST)  /*                        */                         
ALLOCATE                /* ALLOCATE COMMAND DEFAULT  */  +                      
   DEFAULT(OLD)         /*                           */                         
TRANSREC                         /* ALLOCATE COMMAND DEFAULT  */  +             
   NODESMF((*,*))       /*ALLOCATE COMMAND DEFAULT*/ +                          
   CIPHER(YES)          /*                           */ +                       
   SPOOLCL(B)           /*                           */ +                       
   OUTWARN(50000,15000) /*                           */ +                       
   OUTLIM(5000000)      /*                           */ +                       
   VIO(SYSALLDA)        /*                           */ +                       
   LOGSEL(LOG)          /*                           */ +                       
   LOGNAME(MISC)        /*                           */ +                       
   DAPREFIX(TUPREFIX)   /*                           */ +                       
   USRCTL(NAMES.TEXT)   /*                           */ +                       
   SYSOUT(*)            /*                           */                         
./ ADD NAME=ISFPRM00,LEVEL=00,SOURCE=0,LIST=ALL                                 
    /*******************************************/                               
    /* OPTIONS Statement - Global SDSF Options */                               
    /*******************************************/                               
                                                                                
 OPTIONS ATHOPEN(YES),       /* Use authorized open for datasets    */          
   DCHAR('?'),               /* Command query character             */          
   DSI(NO),                  /* Bypass ENQ for dynamic allocation   */          
   FINDLIM(5000),            /* Maximum lines to search for FIND    */          
   IDBLKS(4096),             /* HASPINDX blocksize                  */          
   INDEX(SYS1.ISF.HASPINDX), /* HASPINDX DATASET NAME               */          
   JESDATA(VERSIONS),        /* Use checkpoint versioning           */          
   LINECNT(55),              /* Print lines per page                */          
   LOGLIM(0),                /* OPERLOG search limit in hours       */          
   MENUS(SYS1.ISF.SISFPLIB), /* PANELS DATASET NAME FOR TSO         */          
   NIDBUF(5),                /* Number of haspindx buffers          */          
   NSPBUF(5),                /* Number of spool buffers             */          
   SCHARS('*%'),             /* Generic and placeholder characters  */          
   SCRSIZE(1920),            /* Maximum screen size                 */          
   SYSOUT(A),                /* Default print sysout class          */          
   TIMEOUT(5),               /* Communications timeout in seconds   */          
   TRACE(C000),              /* Default trace mask                  */          
   TRCLASS(A),               /* Default trace sysout class          */          
   UNALLOC(NO)               /* Do not free dynalloc data sets      */          
                                                                                
                                                                                
    /***************************************/                                   
    /* GROUP ISFSPROG - System Programmers */                                   
    /***************************************/                                   
                                                                                
 GROUP NAME(ISFSPROG),       /* Group name                          */          
 TSOAUTH(JCL),               /* USER MUST HAVE JCL, OPER, ACCT      */          
 ACTION(ALL),                /* All route codes displayed           */          
 ACTIONBAR(YES),             /* Display the action bar on panels    */          
 APPC(ON),                   /* Include APPC sysout                 */          
 AUPDT(2),                   /* Minimum auto update interval        */          
 AUTH(LOG,I,O,H,DA,DEST,PREF,     /* Authorized functions           */          
      SYSID,ABEND,ACTION,INPUT,                                                 
      FINDLIM,ST,INIT,PR,TRACE,                                                 
      ULOG,MAS,SYSNAME,LI,SO,NO,RSYS,                                           
      PUN,RDR,JC,SE,RES,SR,SP,                                                  
      ENC,PS),                                                                  
 CMDAUTH(ALL),               /* Commands allowed for all jobs       */          
 CMDLEV(7),                  /* Authorized command level            */          
 CONFIRM(ON),                /* Enable cancel confirmation          */          
 CTITLE(ASIS),               /* Allow mixed case column titles      */          
 CURSOR(ON),                 /* Leave cursor on last row processed  */          
 DADFLT(IN,OUT,TRANS,STC,TSU,JOB),  /* Default rows shown on DA     */          
 DATE(MMDDYYYY),             /* Default date format                 */          
 DATESEP('/'),               /* Default datesep format              */          
 DISPLAY(OFF),               /* Do not display current values       */          
 DSPAUTH(ALL),               /* Browse allowed for all jobs         */          
 GPLEN(2),                   /* Group prefix length                 */          
 ILOGCOL(1),                 /* Initial display column in log       */          
 ISYS(LOCAL),                /* Initial system default              */          
 LANG(ENGLISH),              /* Default language                    */          
 LOGOPT(OPERACT),            /* Default log option                  */          
 OWNER(NONE),                /* Default owner                       */          
 RSYS(NONE),                 /* Initial system default for wtors    */          
 UPCTAB(TRTAB2),             /* Upper case translate table name     */          
 VALTAB(TRTAB),              /* Valid character translate table     */          
 VIO(SYSALLDA)               /* Unit name for page mode output      */          
                                                                                
    /********************************/                                          
    /* Define default SDSF Codepage */                                          
    /********************************/                                          
 TRTAB CODPAG(SDSF) VALTAB(TRTAB) UPCTAB(TRTAB2)                                
./ ADD NAME=JES2PARM,LEVEL=00,SOURCE=0,LIST=ALL                                 
/*****PROPRIETARY-STATEMENT*******************************************/         
/*                                                                   */         
/*     LICENSED MATERIALS-PROPERTY OF IBM                            */         
/*     THIS SAMPLE IS "RESTRICTED MATERIALS OF IBM"                  */         
/*                                                                   */         
/*                                                                   */         
/*****END-OF-PROPRIETARY-STATEMENT************************************/         
/*********************************************************************/         
/*                                                                   */         
/* SYNTAX RULES for JES2 Initialization Statements:                  */         
/*                                                                   */         
/*   - Statements may be coded free-form in Columns 1 through 71     */         
/*   - Column 72 may be used for a Continuation Character, but is    */         
/*     NOT Required.  A trailing comma indicates continuation.       */         
/*   - Comments and Blanks may appear anywhere before, after, or     */         
/*     in-between statements, parameters, and delimiters.            */         
/*   - Comments are NOT allowed within a range.                      */         
/*   - Comments must be bounded by the slash-asterisk,               */         
/*     asterisk-slash type delimiters.                               */         
/*   - Statements must have at least one parameter coded on the      */         
/*     same line as the statement name.                              */         
/*                                                                   */         
/*********************************************************************/         
/*                                                                   */         
/* NOTES on the Format of this Member:                               */         
/*                                                                   */         
/*   - The Order of Statements is Alphabetical within the following  */         
/*     categories:                                                   */         
/*     - ALL Initialization Statements, showing new statements,      */         
/*       new and changed operands, etc.                              */         
/*     - An abbreviated list of statements and operands ADDED        */         
/*       in the JES2 SP 4.1.0 and later releases                     */         
/*     - An abbreviated list of statements and operands CHANGED      */         
/*       in the JES2 SP 4.1.0 and later releases                     */         
/*     - An abbreviated list of statements and operands DELETED      */         
/*       in SP 2.2.0 JES2 or later releases.                         */         
/*     - An abbreviated list of statement operands which cannot      */         
/*       be changed without a COLD start.                            */         
/*                                                                   */         
/* COLUMN layouts of the following statements are as follows:        */         
/*                                                                              
STMT     PARAMETER=DEFAULT,       COMMENTS                   CHG-CODE*/         
/*                                                                   */         
/*    1- 8 - Statement Name                                          */         
/*   10-29 - Parameters set to default values                        */         
/*            ›› - Indicates there is no default, or the default is  */         
/*                   based on other parameters.                      */         
/*            @@ - Indicates the default should not be taken blindly.*/         
/*   30-60 - Comments                                                */         
/*   62-69 - How the Parameter can be changed.  One or more of the   */         
/*           following flags will appear in the change code list.    */         
/*           They are listed in order of flexibility and power, but  */         
/*           these capabilities are not hierarchical.  For example,  */         
/*           some parameters can be changed only by cold starts      */         
/*           and commands.                                           */         
/*                                                                   */         
/*            a  - can be added by $ADD                              */         
/*            o  - can be altered by operand $T                      */         
/*            r  - can be removed by $DEL                            */         
/*            h  - can be altered/added by a hot start               */         
/*                 (if no H, the parm is ignored during hot start)   */         
/*            w  - can be altered/added by JES2 Warm or Quick Start  */         
/*            n  - can be altered/added by a JES2                    */         
/*                 All Member Warm Start                             */         
/*            c  - can be altered/added by JES2 Cold Start           */         
/*                                                                   */         
/*********************************************************************/         
/*********************************************************************/         
/*                                                                   */         
/*  NOTE: Changing ANY of the following parameters will prevent a    */         
/*        JES2 Warmstart; they can ONLY be changed on a COLDSTART    */         
/*                                                                   */         
/*********************************************************************/         
/*                                                                   */         
/*  CKPTDEF   DSNAME=                                                */         
/*  JOBDEF    JOBNUM=                                                */         
/*  NJEDEF    OWNNODE=                                               */         
/*  OUTDEF    JOENUM=                                                */         
/*  SPOOLDEF  BUFSIZE=, DSNAME=, RECINCR=, SPOOLNUM=, TGNUM=,        */         
/*            TRKCELL=, VOLUME=                                      */         
/*  TPDEF     RMTNUM=                                                */         
/*                                                                   */         
/*********************************************************************/         
/*                           *---------------------------------------*          
                             *    Checkpoint Parameters              *          
                             *---------------------------------------*          
                                                                     */         
CKPTDEF  CKPT1=(DSNAME=SYS1.VSYS1PK.HASPCKPT,                                   
                             /* NAME FOR CKPT &DSNPRFX           onc*/          
         VOLSER=SYS1PK,     /* SYS1.HASPCKPT ONC*/                              
         INUSE=YES),         /*                                   onc*/         
         CKPT2=(DSNAME=SYS1.VSYS1PK.HASPCKP2,                                   
                             /* NAME FOR CKPT &DSNPRFX           onc*/          
         VOLSER=SYS1PK,     /* SYS1.HASPCKP2 ONC*/                              
         INUSE=NO),          /*                                   ONC*/         
         DUPLEX=ON,          /* NO DUPLEXING        &CHKPT2       nc*/          
         LOGSIZE=2,          /*                                    nc*/         
         MODE=DUPLEX,        /* NO DUPLEXING        &CHKPT2    ohwnc*/          
         VERSIONS=(NUMBER=0, /* Number of checkpoint versions   ohwnc*/         
                             /*   JES2 will maintain-0 indicates     */         
                             /*   JES2 will determine the maximum    */         
                             /*   number of versions to maintain.    */         
                             /*     (added SP410)                    */         
                             /*       Related to APPLCOPY            */         
            WARN=80),        /* Threshold percentage at which   ohwnc*/         
                             /*   operator is to be notified.        */         
                             /*     (added SP410)                    */         
         VOLATILE=(ONECKPT=WTOR,                                                
                             /* Specifies JES2 should issue WTOR to  */         
                             /* determine action if one CKPT is on a */         
                             /* volatile coupling facility           */         
                             /*     (added in SP510)            ohwnc*/         
                ALLCKPT=WTOR)                                                   
                             /* Specifies JES2 should issue WTOR to  */         
                             /* determine action if all CKPTs are on */         
                             /* volatile coupling facilities         */         
                             /*     (added in SP510)            ohwnc*/         
/*                                                                   */         
/*********************************************************************/         
/*                            *--------------------------------------*          
                              |    Checkpoint Space Definitions      |          
                              *--------------------------------------*          
                                                                     */         
CKPTSPACE BERTNUM=2000,      /* Number of BERTs                    oc*/         
                             /*     (added in OS/390 R4)             */         
          BERTWARN=80        /* $HASP050 threshold for BERTs    ohwnc*/         
                             /*     (added in OS/390 R4)             */         
/*                                                                   */         
/*********************************************************************/         
/*                           *---------------------------------------*          
                             *    Compaction Table Definitions       *          
                             *---------------------------------------*          
                                                                     */         
COMPACT  NAME=JESDATA,       /* NAME OF COMPACTION TABLE         hwnc*/         
         NUMBER=10,          /* Compaction Table Number          hwnc*/         
                             /* Table Definition                 hwnc*/         
         CHARS=(16,          /* - Number of Master Characters    hwnc*/         
          F1,F2,F3,F4,F5,F6, /* - MASTER CHARACTERS              hwnc*/         
          F7,F8,F9,A,E,I,D6, /* - MASTER CHARACTERS              hwnc*/         
          E4,40,X)           /* - MASTER CHARACTERS              hwnc*/         
                             /*                                      */         
/*                                                                   */         
/*********************************************************************/         
/*                            *--------------------------------------*          
                              *    CONSOLE PARAMETERS                *          
                              *--------------------------------------*          
                                                                     */         
CONDEF   AUTOCMD=20,         /* Number of Auto Cmds              hwnc*/         
         BUFNUM=9999,        /* Number of CMBs                  ohwnc*/         
         BUFWARN=80,         /* Warning Threshold %             ohwnc*/         
         CMDNUM=999,         /* Maximum number of CMBs for JES2  ownc*/         
                             /* commands from common storage     ownc*/         
                             /*     (added in SP510)             ownc*/         
         CONCHAR=$,          /* Console Cmd Character           ohwnc*/         
         DISPLEN=64,         /* $SCAN Cmd/init Display Length   ohwnc*/         
         DISPMAX=100,        /* $SCAN Cmd/init Max Lines        ohwnc*/         
         MASMSG=200,         /* Number of Queued Msgs           ohwnc*/         
         RDIRAREA=Z,         /* Default console out-of-line     ohwnc*/         
                             /*   area  (added SP410)           ohwnc*/         
         RDRCHAR=$,          /* Reader Cmd Character            ohwnc*/         
         SCOPE=SYSTEM        /* Specifies scope of command        wnc*/         
                             /*   prefix  (added SP410)              */         
/*                                                                   */         
/*********************************************************************/         
/*                            *--------------------------------------*          
                              *    DEBUG PARAMETERS                  *          
                              *      (revised by OW05639)            *          
                              *    Do not use unless necessary       *          
                              *--------------------------------------*          
                                                                     */         
DEBUG    CKPT=NO,            /* Verify integrity of checkpoint  ohwnc*/         
         MISC=NO,            /* Count certain JES2 events       ohwnc*/         
         STORAGE=NO,         /* Verify GETWORKed areas          ohwnc*/         
         SYMREC=NO,          /* Issue $WTO with SYMREC          ohwnc*/         
                             /*     (added OS110)                    */         
         VERSION=NO          /* Verify integrity of ckpt vers   ohwnc*/         
                             /*                                      */         
/*                                                                   */         
/*********************************************************************/         
/*                           *---------------------------------------*          
                             *   Default Estimated Sysout Bytes/Job  *          
                             *---------------------------------------*          
                                                                     */         
ESTBYTE  NUM=99999,          /* 99999000 Bytes for 1st Message  ohwnc*/         
         INT=99999,          /*  then 99999000 Byte Intervals   ohwnc*/         
         OPT=0               /* Allow Jobs to Continue          ohwnc*/         
                             /*                                      */         
/*                           *---------------------------------------*          
                             *   Default Estimated Execution Time    *          
                             *---------------------------------------*          
                                                                     */         
ESTIME   NUM=2,              /* 2 minutes for 1st Message       ohwnc*/         
         INT=1,              /*  then at 1 minute Intervals     ohwnc*/         
         OPT=NO              /* No HASP308 message              ohwnc*/         
                             /*                                      */         
/*                           *---------------------------------------*          
                             *   Default Estimated Sysout Lines/Job  *          
                             *---------------------------------------*          
                                                                     */         
ESTLNCT  NUM=12,             /*12000 LINES FOR 1ST MESSAGE      ohwnc*/         
         INT=6000,           /*  THEN AT 6000 LINE INTERVALS    ohwnc*/         
         OPT=0               /* Allow Jobs to Continue          ohwnc*/         
                             /*                                      */         
/*                           *---------------------------------------*          
                             *   Default Estimated Sysout Pages/Job  *          
                             *---------------------------------------*          
                                                                     */         
ESTPAGE  NUM=40,             /* 40 PAGES FOR 1ST MESSAGE        ohwnc*/         
         INT=10,             /*  THEN AT 10 PAGE INTERVALS      ohwnc*/         
         OPT=0               /* Allow Jobs to Continue          ohwnc*/         
                             /*                                      */         
/*                           *---------------------------------------*          
                             *   Default Estimated Sysout Cards/Job  *          
                             *---------------------------------------*          
                                                                     */         
ESTPUN   NUM=100,            /* 100 Cards for 1st Message       ohwnc*/         
         INT=2000,           /*  then at 2000 Card Intervals    ohwnc*/         
         OPT=0               /* Allow Jobs to Continue          ohwnc*/         
                             /*                                      */         
/*                           *---------------------------------------*          
                             *   Functional Subsystem Definition     *          
                             *---------------------------------------*          
                                                                     */         
FSS(PRINTOFF)                /* FSS TOKEN FOR PRINTERNN FSS=    aownc*/         
/*       PROC=PRINT,            FSS PROCEDURE TO START FSA       ownc*/         
/*       HASPFSSM=HASPFSSM      FSS Load Module FSS Support      ownc*/         
                             /*                                      */         
/*                            *--------------------------------------*          
                              *    Logical Initiator Definitions     *          
                              *--------------------------------------*          
                                                                     */         
INITDEF  PARTNUM=12          /* NUMBER OF INITIATORS    &MAXPART wnc*/          
                             /*                                      */         
                             /*--------------------------------------*/         
                             /*    Logical Initiators                */         
                             /*--------------------------------------*/         
INIT(1)  NAME=1,             /* INITIATOR NAME                    wnc*/         
         CLASS=A,            /* INITIAL JOB CLASSES              ownc*/         
         START               /* Start Automatically               wnc*/         
                             /*                                      */         
INIT(2)  NAME=2,             /* INITIATOR NAME                    wnc*/         
         CLASS=AB,           /* INITIAL JOB CLASSES              ownc*/         
         START=YES           /* Start Automatically               wnc*/         
                             /*                                      */         
INIT(3)  NAME=3,             /* INITIATOR NAME                    wnc*/         
         CLASS=ABC,          /* INITIAL JOB CLASSES              ownc*/         
         START=YES           /* Start Automatically               wnc*/         
                             /*                                      */         
INIT(4)  NAME=4,             /* INITIATOR NAME                    wnc*/         
         CLASS=ABCDE,        /* INITIAL JOB CLASSES              ownc*/         
         START=YES           /* Start Automatically               wnc*/         
                             /*                                      */         
INIT(5)  NAME=5,             /* INITIATOR NAME                    wnc*/         
         CLASS=ABCD,         /* INITIAL JOB CLASSES              ownc*/         
         START=NO            /*                                      */         
                             /*                                      */         
INIT(6)  NAME=6,             /* INITIATOR NAME                    wnc*/         
         CLASS=ABCD,         /* INITIAL JOB CLASSES              ownc*/         
         START=NO            /*                                      */         
                             /*                                      */         
INIT(7)  NAME=7,             /* INITIATOR NAME                    wnc*/         
         CLASS=ABCD,         /* INITIAL JOB CLASSES              ownc*/         
         START=NO            /*                                      */         
                             /*                                      */         
INIT(8)  NAME=8,             /* INITIATOR NAME                    wnc*/         
         CLASS=ABCD,         /* INITIAL JOB CLASSES              ownc*/         
         START=NO            /*                                      */         
                             /*                                      */         
INIT(9)  NAME=9,             /* INITIATOR NAME                    wnc*/         
         CLASS=ABCD,         /* INITIAL JOB CLASSES              ownc*/         
         START=NO            /*                                      */         
                             /*                                      */         
INIT(10) NAME=10,            /* INITIATOR NAME                    wnc*/         
         CLASS=ABCD,         /* INITIAL JOB CLASSES              ownc*/         
         START=NO            /*                                      */         
                             /*                                      */         
INIT(11) NAME=11,            /* INITIATOR NAME                    wnc*/         
         CLASS=ABCD,         /* INITIAL JOB CLASSES              ownc*/         
         START=NO            /*                                      */         
                             /*                                      */         
INIT(12) NAME=12,            /* INITIATOR NAME                    wnc*/         
         CLASS=ABCD,         /* INITIAL JOB CLASSES              ownc*/         
         START=NO            /*                                      */         
/*                            *--------------------------------------*          
                              *    Internal Readers                  *          
                              *--------------------------------------*          
                                                                     */         
INTRDR   AUTH=(JOB=YES,      /* Allow Job cmds                   ownc*/         
               DEVICE=NO,    /* Allow Device Cmds                ownc*/         
               SYSTEM=YES),  /* Allow System Cmds                ownc*/         
                             /*     (pre-SP420 AUTH=0 for all 3      */         
                             /*      subparameters)                  */         
         BATCH=YES,          /* Allow batch jobs to use           wnc*/         
                             /*     internal readers                 */         
                             /*     (added SP420)                    */         
         CLASS=A,            /* Default Job Class                ownc*/         
         HOLD=NO,            /* Don't Hold Jobs Read             ownc*/         
         HONORLIM=NO,        /* Do output excession for INTRDR   ownc*/         
                             /*     (added by OW06743)               */         
         PRTYINC=0,          /* Don't Prty Age Jobs               wnc*/         
         PRTYLIM=15,         /* Limit Job Prty to 15              wnc*/         
         TRACE=NO            /* Allow Tracing                    ownc*/         
                             /*    (added SP420)                     */         
                             /*                                      */         
/*                            *--------------------------------------*          
                              *    Job Class Characteristics         *          
                              *--------------------------------------*          
                                                                     */         
JOBCLASS(*) AUTH=ALL,        /* All commnds accepted             hwnc*/         
         ACCT=NO,            /* Account   not required           hwnc*/         
         BLP=NO,             /* BLP ignored                      hwnc*/         
         COMMAND=VERIFY,     /* verify commands                  hwnc*/         
         COPY=NO,            /* not TYPRUN=COPY                  hwnc*/         
         HOLD=NO,            /* not TYPRUN=HOLD                  hwnc*/         
         IEFUJP=YES,         /* take SMF Job Purge Exit          hwnc*/         
         IEFUSO=YES,         /* take SYSOUT Excess Exit          hwnc*/         
         JOURNAL=YES,        /* Journal this Job Class           hwnc*/         
         LOG=YES,            /* Print JES2 JOB LOG               hwnc*/         
         MSGLEVEL=(1,1),     /* msg level                        hwnc*/         
         OUTDISP=(HOLD,HOLD),  /* Disposition of System Output   hwnc*/         
                             /*   normal termination and abnormal    */         
                             /*   termination  (added SP410)         */         
                             /*   (pre-SP410=CONDPURG)               */         
         OUTPUT=YES,         /* Produce Output for Job           hwnc*/         
         PERFORM=000,        /* SRM Performance Group 0          hwnc*/         
         PGMRNAME=NO,        /* Pgmrname not required            hwnc*/         
         PROCLIB=00,         /* Use //PROC00 DD                  hwnc*/         
         QHELD=NO,           /* Hold jobs prior to execution    ohwnc*/         
                             /*     (added by APAR OW06439)          */         
         RESTART=NO,         /* No Requeue (XEQ) on IPL          hwnc*/         
         SCAN=NO,            /* Not TYPRUN=SCAN                  hwnc*/         
         TIME=(1440,0),      /* Job Step Time                    hwnc*/         
                             /*   (format changed SP410)             */         
         TYPE6=YES,          /* Produce SMF 6 Records            hwnc*/         
         TYPE26=YES          /* Produce SMF 26 Records           hwnc*/         
                             /*                                      */         
/*                            *--------------------------------------*          
                              *    Job Characteristics               *          
                              *--------------------------------------*          
                                                                     */         
JOBDEF   ACCTFLD=OPTIONAL,  /* Acct'g Field Optional  &RJOBOPT ohwnc*/          
         DUPL_JOB=DELAY,    /* Don't allow jobs with duplicate       */         
                            /*  names to execute concurrently     onc*/         
                            /*     (added OS130)                     */         
         JCLERR=NO,         /* No Term. Job w/JCL Err.&RJOBOPT ohwnc*/          
         JOBNUM=1000,       /* Job Queue Size         &MAXJOBS(1   c*/          
         JOBWARN=80,        /* Warning Threshold %    &MAXJOBS(2 onc*/          
         PRTYHIGH=10,       /* Upper Limit for Aging  &PRIHIGH   onc*/          
         PRTYJECL=YES,      /*PRIORITY JECL Supported &PRIOOPT ohwnc*/          
         PRTYJOB=YES,       /* PRTY= ON JOB NOT SUP'D &PRTYJOB ohwnc*/          
         PRTYLOW=5,         /* Lower Limit for Aging  &PRILOW    onc*/          
         PRTYRATE=0,        /* Prty Aging Rate X/Day  &PRIRATE   onc*/          
         RANGE=(1-9999)     /* Local Job Number Range &JRANGE     oc*/          
                             /*                                      */         
/*                            *--------------------------------------*          
                              *    Default PRTY Calculations         *          
                              *--------------------------------------*          
                                                                     */         
JOBPRTY(1) PRIORITY=9,       /* Job Prty=9 if           &RPRI1 ohwnc*/          
           TIME=2            /*  < 2 min. exec. time    &RPRT1 ohwnc*/          
                             /*                                      */         
JOBPRTY(2) PRIORITY=8,       /* Job Prty=8 if < 5 min.  &RPRI2 ohwnc*/          
           TIME=5            /* etc.                            ohwnc*/         
                             /*                                      */         
JOBPRTY(3) PRIORITY=7,       /* Job Prty=7 if <15 min.  &RPRI2 ohwnc*/          
           TIME=15           /* etc.                            ohwnc*/         
                             /*                                      */         
JOBPRTY(4) PRIORITY=6,       /* Job Prty=6 if nolim     &RPRI2 ohwnc*/          
           TIME=1440         /* etc.                            ohwnc*/         
                             /*                                      */         
/*                            *--------------------------------------*          
                              * Identify JES2 APPLIDs to VTAM        *          
                              *--------------------------------------*          
                                                                     */         
LOGON(1)   APPLID=JES2,      /* ACCESS CONTROL BLOCK (ACB) NAME ohwnc*/         
           LOG=Y,            /* Monitor VTAM interface (Y)      ohwnc*/         
                             /*   or discontinue monitoring (N)      */         
           TRACEIO=NO        /* Trace I/O Activity (YES)        ohwnc*/         
                             /*                                      */         
/*                            *--------------------------------------*          
                              * TP Line for RJE/NJE                  *          
                              *    SNA Line                          *          
                              *--------------------------------------*          
                                                                     */         
LINE(1)  UNIT=SNA            /* LOGICAL LINE 1                  ohwnc*/         
                             /*                                      */         
/*                            *--------------------------------------*          
                              *    Multi-Access Spool                *          
                              *--------------------------------------*          
                                                                     */         
MASDEF   SHARED=NOCHECK,     /* MULTI ACCESS SPOOL NOCHECK      ohwnc*/         
         DORMANCY=(100,500), /*                                 ohwnc*/         
         HOLD=100,           /*                                 ohwnc*/         
         LOCKOUT=1200        /*                                 ohwnc*/         
                             /*                                      */         
/*                            *--------------------------------------*          
                              *    NJE Definitions                   *          
                              *--------------------------------------*          
                                                                     */         
NJEDEF   DELAY=120,          /* Max. Msg Delay Time             ohwnc*/         
         HDRBUF=(LIMIT=100,  /* Number of NJE header + trailer  ohwnc*/         
                             /*     buffers                          */         
              WARN=80),      /* Warning Threshhold              ohwnc*/         
         JRNUM=2,            /* Number of job receivers          hwnc*/         
         JTNUM=2,            /* Number of job xmitters           hwnc*/         
         LINENUM=5,          /* Number of lines for NJE          hwnc*/         
         MAILMSG=NO,         /* Don't automatically issue       ohwnc*/         
                             /* notification message                 */         
         MAXHOP=0,           /* Num. of iterations to limit      hwnc*/         
                             /*     hoping in network                */         
                             /* 0 means no hop counting              */         
         NODENUM=50,         /* Max. number of NJE nodes           nc*/         
         OWNNODE=1,          /* this node's number                  c*/         
         PATH=1,             /* number of paths                  hwnc*/         
         RESTMAX=8000000,    /* Max. resistance tolerance       ohwnc*/         
         RESTNODE=150,       /* this node's resistance          ohwnc*/         
         RESTTOL=300,        /* Alt. resistance tolerance       ohwnc*/         
         SRNUM=2,            /* number of sysout receivers       hwnc*/         
         STNUM=2,            /* number of sysout xmitters        hwnc*/         
         TIMETOL=30          /* Time variation between clocks   ohwnc*/         
                             /* Times are in 1/100 sec. unless spec'd*/         
                             /*                                      */         
/*                            *--------------------------------------*          
                              *    Offlaod Data Set                  *          
                              *--------------------------------------*          
                                                                     */         
OFFLOAD1 DSN=SYS1.OFFLOAD    /* DATA SET NAME           DSN     ohwnc*/         
                             /* No. of Devices (units)  UNITCT  ohwnc*/         
                             /*                                      */         
/*                            *--------------------------------------*          
                              *    JES2 Options Definition           *          
                              *--------------------------------------*          
                                                                     */         
OPTSDEF  LIST=NO,            /* Do not copy following init.      hwnc*/         
                             /*   stmts. to HARDCOPY console         */         
         LOG=NO,             /* Do not copy following init stmts hwnc*/         
                             /*   to printer defined on HASPLIST     */         
         SPOOL=NOVALIDATE    /* Do not validate track group map    nc*/         
                             /*--------------------------------------*/         
                             /* The following options can only       */         
                             /* be overridden when the JES2          */         
                             /* initialization process is in         */         
                             /* CONSOLE mode.                        */         
                             /*--------------------------------------*/         
/*       CKPTOPT=HIGHEST      * Use highest checkpoint to        hwnc*/         
/*                            *      restart                         */         
/*       CONSOLE=YES          * Prompt for more init. stmts.     hwnc*/         
/*       LISTOPT=NO           * Support LIST start option        hwnc*/         
/*       LOGOPT=YES           * Support LOG start option         hwnc*/         
/*       RECONFIG=YES         * Allow op to specify RECONFIG     hwnc*/         
/*       REQMSG=YES           * Display HASP400 message          hwnc*/         
/*                                                                   */         
/*                                                                   */         
/*                            *--------------------------------------*          
                              *    Output Class Attributes $$a       *          
                              *--------------------------------------*/         
OUTCLASS(A) BLNKTRNC=YES,    /* Truncate trailing blanks          wnc*/         
         OUTDISP=(WRITE,WRITE), /* OUT disp             PRINT    ownc*/         
         OUTPUT=PRINT,       /* Print Class             PRINT     wnc*/         
         TRKCELL=YES         /* Track-Cell this Class   NOTRKCEL  wnc*/         
                             /*                                      */         
OUTCLASS(B) BLNKTRNC=YES,    /* Truncate trailing blanks          wnc*/         
         OUTDISP=(WRITE,WRITE), /* OUT disp             PRINT    ownc*/         
         OUTPUT=PUNCH,       /* Print Class             PRINT     wnc*/         
         TRKCELL=YES         /* Track-Cell this Class   NOTRKCEL  wnc*/         
                             /*                                      */         
OUTCLASS(C) BLNKTRNC=YES,    /* Truncate trailing blanks          wnc*/         
         OUTDISP=(WRITE,WRITE), /* OUT disp             PRINT    ownc*/         
         OUTPUT=PRINT,       /* Print Class             PRINT     wnc*/         
         TRKCELL=YES         /* Track-Cell this Class   NOTRKCEL  wnc*/         
                             /*                                      */         
OUTCLASS(D) BLNKTRNC=YES,    /* TRUNCATE TRAILING BLANKS          wnc*/         
         OUTDISP=(WRITE,WRITE), /* OUT disp             PRINT    ownc*/         
         OUTPUT=PRINT,       /* Print Class             PRINT     wnc*/         
         TRKCELL=YES         /* Track-Cell this Class   NOTRKCEL  wnc*/         
                             /*                                      */         
OUTCLASS(H) BLNKTRNC=YES,    /* TRUNCATE TRAILING BLANKS          wnc*/         
         OUTDISP=(HOLD,HOLD), /* HOLD disp              HOLD     ownc*/         
         OUTPUT=PRINT,       /* Print Class             PRINT     wnc*/         
         TRKCELL=YES         /* Track-Cell this Class   NOTRKCEL  wnc*/         
                             /*                                      */         
OUTCLASS(J) BLNKTRNC=YES,    /* TRUNCATE TRAILING BLANKS          wnc*/         
         OUTDISP=(WRITE,WRITE), /* OUT disp             PRINT    ownc*/         
         OUTPUT=PRINT,       /* Print Class             PRINT     wnc*/         
         TRKCELL=YES         /* Track-Cell this Class   NOTRKCEL  wnc*/         
                             /*                                      */         
OUTCLASS(K) BLNKTRNC=YES,    /* TRUNCATE TRAILING BLANKS          wnc*/         
         OUTDISP=(HOLD,HOLD), /* OUT disp               PRINT    ownc*/         
         OUTPUT=PRINT,       /* Print Class             PRINT     wnc*/         
         TRKCELL=YES         /* Track-Cell this Class   NOTRKCEL  wnc*/         
                             /*                                      */         
OUTCLASS(L) BLNKTRNC=YES,    /* TRUNCATE TRAILING BLANKS          wnc*/         
         OUTDISP=(WRITE,WRITE), /* OUT disp             PRINT    ownc*/         
         OUTPUT=PRINT,       /* Print Class             PRINT     wnc*/         
         TRKCELL=YES         /* Track-Cell this Class   NOTRKCEL  wnc*/         
                             /*                                      */         
OUTCLASS(O) BLNKTRNC=YES,    /* TRUNCATE TRAILING BLANKS          wnc*/         
         OUTDISP=(HOLD,HOLD), /* OUT disp               PRINT    ownc*/         
         OUTPUT=PRINT,       /* Print Class             PRINT     wnc*/         
         TRKCELL=YES         /* Track-Cell this Class   NOTRKCEL  wnc*/         
                             /*                                      */         
OUTCLASS(X) BLNKTRNC=YES,    /* TRUNCATE TRAILING BLANKS          wnc*/         
         OUTDISP=(HOLD,HOLD), /* OUT disp               PRINT    ownc*/         
         OUTPUT=PRINT,       /* Print Class             PRINT     wnc*/         
         TRKCELL=YES         /* Track-Cell this Class   NOTRKCEL  wnc*/         
                             /*                                      */         
OUTCLASS(Z) BLNKTRNC=YES,    /* TRUNCATE TRAILING BLANKS          wnc*/         
         OUTDISP=(HOLD,HOLD), /* OUT disp               PRINT    ownc*/         
         OUTPUT=DUMMY,       /* Print Class             PRINT     wnc*/         
         TRKCELL=YES         /* Track-Cell this Class   NOTRKCEL  wnc*/         
                             /*                                      */         
OUTCLASS(5) BLNKTRNC=YES,    /* TRUNCATE TRAILING BLANKS          wnc*/         
         OUTDISP=(PURGE,PURGE), /* OUT disp             PRINT    ownc*/         
         OUTPUT=DUMMY,       /* Print Class             PRINT     wnc*/         
         TRKCELL=YES         /* Track-Cell this Class   NOTRKCEL  wnc*/         
                             /*                                      */         
OUTCLASS(9) BLNKTRNC=YES,    /* TRUNCATE TRAILING BLANKS          wnc*/         
         OUTDISP=(PURGE,PURGE), /* OUT disp             PRINT    ownc*/         
         OUTPUT=DUMMY,       /* Print Class             PRINT     wnc*/         
         TRKCELL=YES         /* Track-Cell this Class   NOTRKCEL  wnc*/         
                             /*                                      */         
/*                            *--------------------------------------*          
                              *    Output Characteristics            *          
                              *--------------------------------------*          
                                                                     */         
OUTDEF   BRODCAST=NO,        /* Whether shared broadcasting        oc*/         
                             /*  is in use by this complex           */         
         COPIES=30,          /* MAX.  COPIES ALLWD &JCOPYLM    ohwnc*/          
         DMNDSET=NO,         /* No Demand Setup    &DMNDSET      wnc*/          
         JOENUM=1500,        /* MAX.  OF JOES      &NUMJOES(,      c*/          
         JOEWARN=80,         /* Warning Threshold  &NUMJOES(,% ohwnc*/          
         OUTTIME=CREATE,     /* Specifies when JOE time saved   ohwnc*/         
                             /*     (added SP410)                    */         
         PRTYHIGH=255,       /* Ceiling for PRTY Aging  ---     ohwnc*/         
         PRTYLOW=0,          /* Floor for PRTY Aging    ---     ohwnc*/         
         PRTYOUT=NO,         /* No PRTY= on // OUTPUT &PRTYOUT ohwnc*/          
         PRYORATE=0,         /* Don't priority age              ohwnc*/         
         SEGLIM=100,         /* Max. number output segments      ownc*/         
         STDFORM=STD,        /* Default Forms ID   &STDFORM      wnc*/          
         USERSET=NO          /* No User Demand-Setup &USERSET    wnc*/          
                             /*                                      */         
/*                           *---------------------------------------*          
                             *   Default Output Priority             *          
                             *---------------------------------------*          
                                                                     */         
                             /* based on records (line mode)         */         
                             /*         or pages (page mode)         */         
OUTPRTY(1) PRIORITY=144,     /* OUTPUT PRTY IS 144 IF   &XPRI1 ohwnc*/          
           RECORD=2000,      /*  < 2000 RECORDS (LINE)  &XLIN1 ohwnc*/          
           PAGE=50           /*  OR < 50 PAGES (PAGE)   &XPAG1 ohwnc*/          
                             /*                                      */         
OUTPRTY(2) PRIORITY=128,     /* OUTPUT PRTY IS 128 IF   &XPRI1 ohwnc*/          
           RECORD=5000,      /*  < 5000 RECORDS (LINE)  &XLIN1 ohwnc*/          
           PAGE=100          /*  OR <100 PAGES (PAGE)   &XPAG1 ohwnc*/          
                             /*                                      */         
OUTPRTY(3) PRIORITY=112,     /* OUTPUT PRTY IS 112 IF   &XPRI1 ohwnc*/          
           RECORD=15000,     /*  <15000 RECORDS (LINE)  &XLIN1 ohwnc*/          
           PAGE=300          /*  OR <300 PAGES (PAGE)   &XPAG1 ohwnc*/          
                             /*                                      */         
OUTPRTY(4) PRIORITY=96,      /* OUTPUT PRTY IS  96 IF   &XPRI1 ohwnc*/          
           RECORD=16677215,  /*  < MAX  RECORDS (LINE)  &XLIN1 ohwnc*/          
           PAGE=16677215     /*  OR <MAX PAGES (PAGE)   &XPAG1 ohwnc*/          
                             /*                                      */         
OUTPRTY(5) PRIORITY=80,      /* OUTPUT PRTY IS  80 IF   &XPRI1 ohwnc*/          
           RECORD=16677215,  /*  < MAX  RECORDS (LINE)  &XLIN1 ohwnc*/          
           PAGE=16677215     /*  OR <MAX PAGES (PAGE)   &XPAG1 ohwnc*/          
                             /*                                      */         
OUTPRTY(6) PRIORITY=64,      /* OUTPUT PRTY IS  64 IF   &XPRI1 ohwnc*/          
           RECORD=16677215,  /*  < MAX  RECORDS (LINE)  &XLIN1 ohwnc*/          
           PAGE=16677215     /*  OR <MAX PAGES (PAGE)   &XPAG1 ohwnc*/          
                             /*                                      */         
OUTPRTY(7) PRIORITY=48,      /* OUTPUT PRTY IS  48 IF   &XPRI1 ohwnc*/          
           RECORD=16677215,  /*  < MAX  RECORDS (LINE)  &XLIN1 ohwnc*/          
           PAGE=16677215     /*  OR <MAX PAGES (PAGE)   &XPAG1 ohwnc*/          
                             /*                                      */         
OUTPRTY(8) PRIORITY=32,      /* OUTPUT PRTY IS  32 IF   &XPRI1 ohwnc*/          
           RECORD=16677215,  /*  < MAX  RECORDS (LINE)  &XLIN1 ohwnc*/          
           PAGE=16677215     /*  OR < 50 PAGES (PAGE)   &XPAG1 ohwnc*/          
                             /*                                      */         
OUTPRTY(9) PRIORITY=16,      /* OUTPUT PRTY IS  16 IF   &XPRI1 ohwnc*/          
           RECORD=16677215,  /*  < MAX  RECORDS (LINE)  &XLIN1 ohwnc*/          
           PAGE=16677215     /*  OR <MAX PAGES (PAGE)   &XPAG1 ohwnc*/          
                             /*                                      */         
/*                            *--------------------------------------*          
                              *    JES2 Processor Numbers            *          
                              *--------------------------------------*          
                                                                     */         
PCEDEF   CNVTNUM=2,          /* 2 Converter PCEs        ---      hwnc*/         
         PSONUM=2,           /* 2 PSO PCEs              ---      hwnc*/         
         OUTNUM=2,           /* 2 Output PCEs           ---      hwnc*/         
         PURGENUM=2,         /* 2 Purge PCEs            ---      hwnc*/         
         SPINNUM=3,          /* 2 Spin PCEs             ---      hwnc*/         
         STACNUM=2           /* 2 STATUS/CANCEL PCEs    ---      hwnc*/         
                             /*                                      */         
/*                            *--------------------------------------*          
                              *    Printing Characteristics          *          
                              *--------------------------------------*          
                                                                     */         
PRINTDEF CCWNUM=10,          /*  CCWS / PRINT BUFFER   &NOPRCCW wnc*/           
         DBLBUFR=YES,        /* Double Buffer Lcl Prts  &PRTBOPT wnc*/          
         FCB=EX01,           /* INITIAL FCB LOADED      &PRTFCB  wnc*/          
         LINECT=61,          /* 61 LINES/PAGE          &LINECT ohwnc*/          
         NIUCS=GF10,         /* 3800 Char. Set Loaded   &NIPUCS  wnc*/          
         RDBLBUFR=NO,        /* Single Buffer Rmt Prts  &RPRBOPT wnc*/          
         SEPPAGE=(LOCAL=DOUBLE,                                                 
                             /* Separator page defaults         ohwnc*/         
                             /*     (added SP410)                    */         
                             /*   Local printer  (pre SP410 SEPLINE) */         
             REMOTE=HALF),   /*   Remote printer (pre SP410 RSEPLINE)*/         
         TRANS=YES,          /* PN-Xlate for 1403/Rm.Pr &PRTRANS wnc*/          
         UCS=0               /* Bypass UCS-Loading      &PRTUCS  wnc*/          
                             /*                                      */         
/*                           *---------------------------------------*          
                             *    Printer Parameters                 *          
                             *---------------------------------------*          
                                                                     */         
                             /* More WS parms(JOBNAME,RANGE,VOLUME)OC*/         
/*                           *---------------------------------------*          
                             *    Punch parameters                   *          
                             *---------------------------------------*          
                                                                     */         
PUNCHDEF CCWNUM=02,          /*  CCWs / Punch Buffer    &NOPUCCW wnc*/          
         DBLBUFR=NO,         /* Single Buffer Lcl Puns  &PUNBOPT wnc*/          
         RDBLBUFR=NO         /* Single Buffer Rmt Puns  &RPUBOPT wnc*/          
                             /*                                      */         
/*                           *---------------------------------------*          
                             *    SMF Definitions                    *          
                             *---------------------------------------*          
                                                                     */         
SMFDEF   BUFNUM=5,           /* No. of SMF Buffers   &SMFBUF(,   wnc*/          
         BUFWARN=80          /* Warn Threshold %     &SMFBUF(,%ohwnc*/          
                             /*                                      */         
/*                            *--------------------------------------*          
                              *    SPOOL Definitions                 *          
                              *--------------------------------------*          
                                                                     */         
SPOOLDEF BUFSIZE=3856,       /* MAXIMUM BUFFER SIZE     &BUFSIZE   c*/          
         DSNAME=SYS1.VSYS1PK.HASPACE,                                           
         FENCE=NO,           /* Don't Force to Min.Vol. &FENCE    oc*/          
         SPOOLNUM=32,        /* Max. Num. Spool Vols    ---         c*/         
         TGBPERVL=5,         /* Track Groups per volume in BLOB  ownc*/         
         TGSIZE=33,          /* 30 BUFFERS/TRACK GROUP  &TGSIZE  wnc*/          
         TGSPACE=(MAX=16288, /* Fits TGMs into 4K Page  &NUMTG=(,  c*/          
                  WARN=80),  /*                       &NUMTG=(,% onc*/          
         TRKCELL=5,          /* 5 Buffers/Track-cell    &TCELSIZ   c*/          
         VOLUME=SYS1P /* SPOOL VOLUME SERIAL   &SPOOL     C*/                   
                             /*                                      */         
/*                            *--------------------------------------*          
                              *    STC Defaults                      *          
                              *--------------------------------------*          
                                                                     */         
                             /*    on &RDROPST = bppmmmmsscrlaaaaeWS*/          
JOBCLASS(STC) TIME=(1440,00), /* Job Step Time   ...mmmmss....... WS*/          
         COMMAND=EXECUTE,    /* Execute Commands ..........r...... WS*/         
         BLP=NO,             /* Ignore BLP parm  ...........l..... WS*/         
         AUTH=ALL,           /* Allow all Cmds   ............aaaa. WS*/         
         MSGLEVEL=(1,1),     /* Job, All Msgs    ................e WS*/         
         IEFUJP=YES,         /* Take SMF Job Purge Exit IEFUJP     WS*/         
         IEFUSO=YES,         /* Take SYSOUT Excess Exit IEFUSO     WS*/         
         OUTDISP=(PURGE,HOLD),       /*                            WS*/         
         LOG=YES,            /* Print JES2 JOB LOG      LOG        WS*/         
         OUTPUT=YES,         /* Produce Output for Job  OUTPUT     WS*/         
         PERFORM=000,        /* SRM Performance Group 0 PERFORM  hwnc*/         
         PROCLIB=00,         /* Use //PROC00 DD                  hwnc*/         
         REGION=0K,          /* Region Size                      hwnc*/         
                             /*   (format changed SP410)             */         
         TYPE6=YES,          /* Produce SMF 6 Records   TYPE6      WS*/         
         TYPE26=YES,         /* Produce SMF 26 Records  TYPE26     WS*/         
         MSGCLASS=K          /* Default Message Class   STCMCLAS   WS*/         
                             /*                                      */         
                             /*--------------------------------------*/         
                             /*    Subtask definition                */         
                             /*--------------------------------------*/         
 SUBTDEF  GSUBNUM=10         /* Specify the number of general    hwnc*/         
                             /* purpose subtask                      */         
                             /*                                      */         
/*                            *--------------------------------------*          
                              *    TSU Defaults         &TSU        *           
                              *--------------------------------------*          
                                                                     */         
                             /*    on &RDROPSL = bppmmmmsscrlaaaaeWS*/          
JOBCLASS(TSU) TIME=(0120,00), /* Job Step Time   ...mmmmss........ WS*/         
         COMMAND=EXECUTE,    /* Execute Commands ..........r...... WS*/         
         BLP=NO,             /* Ignore BLP parm  ...........l..... WS*/         
         AUTH=ALL,           /* Allow all Cmds   ............aaaa. WS*/         
         MSGLEVEL=(1,1),     /* Job, All Msgs    ................e WS*/         
         IEFUJP=YES,         /* Take SMF Job Purge Exit IEFUJP     WS*/         
         IEFUSO=YES,         /* Take SYSOUT Excess Exit IEFUSO     WS*/         
         OUTDISP=(PURGE,HOLD),       /*                            WS*/         
         LOG=YES,            /* Print JES2 JOB LOG      LOG        WS*/         
         OUTPUT=YES,         /* Produce Output for Job  OUTPUT     WS*/         
         PERFORM=0,          /* SRM Performance Group 0 PERFORM    WS*/         
         PROCLIB=00,         /* Use //PROC00 DD         PROCLIB    WS*/         
         TYPE6=YES,          /* Produce SMF 6 Records   TYPE6      WS*/         
         TYPE26=YES,         /* Produce SMF 26 Records  TYPE26     WS*/         
         MSGCLASS=K          /* Default Message Class   TSUMCLAS   WS*/         
                             /*                                      */         
/*********************************************************************/         
/*                                                                   */         
/*      CHANGED Initialization Statements  (New Parameters)          */         
/*                                                                   */         
/*********************************************************************/         
                             /*--------------------------------------*/         
                             /*    Recovery Options                  */         
                             /*--------------------------------------*/         
                             /* Error Type               --- (new) OC*/         
/*CVOPTS (ALL)                  JES2 MAIN TASK           --- (NEW) OC*/         
                             /*                                      */         
                             /*--------------------------------------*/         
                             /*    $TRACE Facility                   */         
                             /*--------------------------------------*/         
TRACE(1) START=NO            /* Spin Log after 500 Pgs &TRLOGSZ hwnc*/          
                             /*                                      */         
/*********************************************************************/         
/*                                                                   */         
/* Existing Initialization Statements Including New Parameters.      */         
/* - Note: Not ALL Parameters are shown, especially for devices.     */         
/*                                                                   */         
/*********************************************************************/         
TPDEF    EXTBUF=(LIMIT=30,SIZE=3840,WARN=80)                                    
/*********************************************************************/         
/*********************************************************************/         
/*                                                                   */         
/*                 DELETED Initialization Parameters                 */         
/*                                                                   */         
/*********************************************************************/         
/*                                                                   */         
/*  &BSVBOPT                      JES2 Assumes YES                  */          
/*  &DELAYTM                      Uses 100                          */          
/*  &MAXCLAS                      Uses Maximum (36)                 */          
/*  &NUMCLAS                      Fixed at 15                       */          
/*  &NUMDMPS                      Calculated from OFFLOADn Stmts    */          
/*  &NUMLODS                      Calculated from OFFLOADn Stmts    */          
/*  &NUMLOGS                      Calculated from LOGON1/2          */          
/*  &NUMLNES                      Calculated from LINE Statements   */          
/*  &NUMPRTS                      Calculated from PRINTER Statements*/          
/*  &NUMPUNS                      Calculated from PUNCHnn Statements*/          
/*  &NUMRDRS                      Calculated from  of READERnn     */           
/*  &RPS                          Always YES                        */          
/*  &SPFPRFX                      No More DSN Prefixes              */          
/*  &SPOLMSG                      Uses Maximum (254) if TP Lines > 0*/          
/*  &XBATCH                       Calculated from XBATCH on JOBDEF  */          
/*                                                                   */         
./ ADD NAME=LOAD00,LEVEL=00,SOURCE=0,LIST=ALL                                   
IODF     00 SYS1     TESTLPAR SF Y                                              
SYSCAT   SYS1PK113CSYS1.MCAT.VSYS1PK                                            
PARMLIB  SYS1.PARMLIB                                                           
PARMLIB  SYS1.IBM.PARMLIB                                                       
IEASYM   (00,L)                                                                 
INITSQA  0000M 0002M                                                            
./ ADD NAME=LPALST00,LEVEL=00,SOURCE=0,LIST=ALL                                 
SYS1.LPALIB,                                                                    
SYS1.EUV.SEUVLPA,                                                               
SYS1.ISP.SISPLPA,                                                               
SYS1.ISF.SISFLPA,                                                               
SYS1.SCNMLPA1,                                                                  
SYS1.SDWWDLPA,                                                                  
SYS1.REXX.SEAGALT,                                                              
SYS1.SYNCSORT.ZOS.SYNCLPA,                                                      
SYS1.SYNCSORT.ZOS.SYNCRENT                                                      
./ ADD NAME=MSTJCL00,LEVEL=00,SOURCE=0,LIST=ALL                                 
//MSTJCL00 JOB MSGLEVEL=(1,1),TIME=NOLIMIT                                      
//         EXEC PGM=IEEMB860,DPRTY=(15,15)                                      
//STCINRDR DD SYSOUT=(A,INTRDR)                                                 
//TSOINRDR DD SYSOUT=(A,INTRDR)                                                 
//IEFPDSI  DD DSN=SYS1.PROCLIB,DISP=SHR                                         
//         DD DSN=SYS1.IBM.PROCLIB,DISP=SHR                                     
//SYSUADS  DD DSN=SYS1.UADS,DISP=SHR                                            
//SYSLBC   DD DSN=SYS1.BRODCAST,DISP=SHR /*IGNORED Z/OS 1.3 AND ABOVE*/         
./ ADD NAME=PROG00,LEVEL=00,SOURCE=0,LIST=ALL                                   
SYSLIB LINKLIB(SYS1.VSYS1PK.LINKLIB)                                            
SYSLIB LPALIB(SYS1.VSYS1PK.LPALIB)                                              
 /*                                        */                                   
APF FORMAT(DYNAMIC)                                                             
APF ADD DSNAME(SYS1.LINKLIB)                  VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.MIGLIB)                   VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.CSSLIB)                   VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.SIEALNKE)                 VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.SIEAMIGE)                 VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.SHASMIG)                  VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.SHASLNKE)                 VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.CMDLIB)                   VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.LPALIB)                   VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.CEE.SCEERUN)              VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.EUV.SEUVLINK)             VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.SISTCLIB)                 VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.ISP.SISPLOAD)             VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.VTAMLIB)                  VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.FDR.LINKLIB)              VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.SYNCSORT.ZOS.SYNCLPA)     VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.SYNCSORT.ZOS.SYNCRENT)    VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.SYNCSORT.ZOS.SYNCAUTH)    VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.SYNCSORT.ZOS.SYNCLINK)    VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.VSYS1PK.LINKLIB)          VOLUME(SYS1PK)                    
APF ADD DSNAME(SYS1.VSYS1PK.LPALIB)           VOLUME(SYS1PK)                    
 /*                                        */                                   
LNKLST DEFINE NAME(LNKLST00)                                                    
LNKLST ADD NAME(LNKLST00) DSN(SYS1.LINKLIB)                                     
LNKLST ADD NAME(LNKLST00) DSN(SYS1.MIGLIB)                                      
LNKLST ADD NAME(LNKLST00) DSN(SYS1.CSSLIB)                                      
LNKLST ADD NAME(LNKLST00) DSN(SYS1.SIEALNKE)                                    
LNKLST ADD NAME(LNKLST00) DSN(SYS1.SIEAMIGE)                                    
LNKLST ADD NAME(LNKLST00) DSN(SYS1.CEE.SCEERUN)                                 
LNKLST ADD NAME(LNKLST00) DSN(SYS1.EUV.SEUVLINK)                                
LNKLST ADD NAME(LNKLST00) DSN(SYS1.SASMMOD1)                                    
LNKLST ADD NAME(LNKLST00) DSN(SYS1.SHASMIG)                                     
LNKLST ADD NAME(LNKLST00) DSN(SYS1.SHASLNKE)                                    
LNKLST ADD NAME(LNKLST00) DSN(SYS1.CMDLIB)                                      
LNKLST ADD NAME(LNKLST00) DSN(SYS1.VTAMLIB)                                     
LNKLST ADD NAME(LNKLST00) DSN(SYS1.SCBDHENU)                                    
LNKLST ADD NAME(LNKLST00) DSN(SYS1.SISTCLIB)                                    
LNKLST ADD NAME(LNKLST00) DSN(SYS1.ISF.SISFLOAD)                                
LNKLST ADD NAME(LNKLST00) DSN(SYS1.ISP.SISPLOAD)                                
LNKLST ADD NAME(LNKLST00) DSN(SYS1.ISF.SISFLINK)                                
LNKLST ADD NAME(LNKLST00) DSN(SYS1.FDR.LINKLIB)                                 
LNKLST ADD NAME(LNKLST00) DSN(SYS1.SYNCSORT.ZOS.SYNCAUTH)                       
LNKLST ADD NAME(LNKLST00) DSN(SYS1.SYNCSORT.ZOS.SYNCLINK)                       
LNKLST ACTIVATE NAME(LNKLST00)                                                  
./ ADD NAME=SMFPRM00,LEVEL=00,SOURCE=0,LIST=ALL                                 
 ACTIVE                          /* ACTIVE SMF RECORDING             */         
 DSNAME(SYS1.VSYS1PK.MAN1,                                                      
        SYS1.VSYS1PK.MAN2)                                                      
 NOPROMPT                        /* DO NOT PROMPT OPERATOR           */         
 REC(PERM)                       /* TYPE 17 PERM RECORDS ONLY        */         
 MAXDORM(3000)                   /* WRITE IDLE BUFFER AFTER 30 MIN   */         
 STATUS(010000)                  /* WRITE SMF STATS AFTER 1 HOUR     */         
 JWT(0030)                       /* 522 AFTER 30 MINUTES             */         
 SID(&SYSNAME)                   /* SMF SYSID                        */         
 LISTDSN                         /* LIST DATA SET STATUS AT IPL      */         
 SYS(NOTYPE(14:19,62:69,99),EXITS(IEFU83,IEFU84,IEFACTRT,                       
               IEFUSI,IEFUJI,IEFU29),NOINTERVAL,NODETAIL)                       
 /* WRITE ALL EXCEPT DATA MANAGEMENT RECORDS, TAKE EXITS.            */         
 /* NOTE: JES EXITS CONTROLED BY JES , THERE IS NO                   */         
 /* DEFAULT INTERVAL RECORDS WRITTEN AND ONLY SUMMARY T32            */         
 /* RECORDS AS A DEFAULT FOR TSO.                                    */         
 SUBSYS(STC,EXITS(IEFU29,IEFU83,IEFU84,IEFUJP,IEFUSO))                          
 /* WRITE RECORDS ACCORDING TO SYS VALUE, TAKE ONLY FIVE             */         
 /* EXITS, NOTE: IEFU29 EXECUTES IN THE MASTER ASID WHICH IS A       */         
 /* STC ADDRESS SPACE SO IEFU29 MUST BE ON FOR STC.                  */         
 /* USE ALL OTHER SYS PARMETERS AS A DEFAULT.                        */         
./ ADD NAME=TSOKEY00,LEVEL=00,SOURCE=0,LIST=ALL                                 
USERMAX=10,                                                            +        
RECONLIM=3,                                                            +        
BUFRSIZE=132,                                                          +        
HIBFREXT=6600,                                                         +        
LOBFREXT=3300,                                                         +        
CHNLEN=4,                                                              +        
SCRSIZE=1920                                                                    
./ ADD NAME=VATLST00,LEVEL=00,SOURCE=0,LIST=ALL                                 
VATDEF IPLUSE(PRIVATE) SYSUSE(PRIVATE)                                          
SYS1PK,0,0,3390                                                                 
./ ENDUP                                                                        
@#                                                                              
//*****************************************************************             
//* UPDATE PROCLIB WITH REQUIRED MEMBERS                                        
//*****************************************************************             
//UPROC16  EXEC PGM=IEBUPDTE,PARM=NEW,REGION=4M,COND=(0,NE)                     
//SYSUT2   DD  DSN=SYS1.PROCLIB,DISP=SHR,                                       
//             UNIT=SYSALLDA,VOL=SER=SYS1PK                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DATA,DLM=@#                                                      
./ ADD NAME=IRRDPTAB,LEVEL=00,SOURCE=0,LIST=ALL                                 
//IRRDPTAB PROC                                                                 
//*  THIS STARTED TASK IS RUN AT IPL TO LOAD THE RACF DYNAMIC                   
//*  PARSE TABLES.  THE USERID FOR THE TASK MUST BE AUTHORIZED                  
//*  TO ISSUE THE IRRDPI00 COMMAND.                                             
//         EXEC PGM=IKJEFT01,REGION=1M,PARM='IRRDPI00 UPDATE'                   
//SYSTSPRT DD SYSOUT=*,HOLD=YES                                                 
//SYSUDUMP DD SYSOUT=*,HOLD=YES                                                 
//SYSUT1   DD DSN=SYS1.SAMPLIB(IRRDPSDS),DISP=SHR                               
//SYSTSIN  DD DUMMY                                                             
./ ADD NAME=IKJACCNT,LEVEL=00,SOURCE=0,LIST=ALL                                 
//IKJACCNT PROC                                                                 
//IKJACCNT EXEC PGM=IKJEFT01,DYNAMNBR=90,PARM='%LOGPROF'                        
//SYSEXEC  DD DISP=SHR,DSN=SYS1.ISP.SISPEXEC         ISPF                       
//SYSPROC  DD DISP=SHR,DSN=SYS1.ISP.SISPCLIB         ISPF                       
//         DD DISP=SHR,DSN=SYS1.SCBDCLST             HCD                        
//SYSHELP  DD DISP=SHR,DSN=SYS1.HELP                 TSO                        
//ISPTLIB  DD DISP=SHR,DSN=SYS1.ISP.SISPTENU         ISPF                       
//         DD DISP=SHR,DSN=SYS1.ISF.SISFTLIB         SDSF                       
//ISPSLIB  DD DISP=SHR,DSN=SYS1.ISP.SISPSLIB         ISPF                       
//         DD DISP=SHR,DSN=SYS1.ISP.SISPSENU         ISPF                       
//ISPMLIB  DD DISP=SHR,DSN=SYS1.ISP.SISPMENU         ISPF                       
//         DD DISP=SHR,DSN=SYS1.ISF.SISFMLIB         SDSF                       
//ISPPLIB  DD DISP=SHR,DSN=SYS1.ISP.SISPPENU         ISPF                       
//         DD DISP=SHR,DSN=SYS1.ISF.SISFPLIB         SDSF                       
//SYSPRINT DD TERM=TS,SYSOUT=*                                                  
//SYSTERM  DD TERM=TS,SYSOUT=*                                                  
//SYSIN    DD TERM=TS                                                           
./ ADD NAME=TSOJCL,LEVEL=00,SOURCE=0,LIST=ALL                                   
//TSOJCL   PROC                                                                 
//TSOJCL   EXEC PGM=IKJEFT01,DYNAMNBR=90,PARM='%LOGPROF'                        
//SYSEXEC  DD DISP=SHR,DSN=SYS1.ISP.SISPEXEC         ISPF                       
//SYSPROC  DD DISP=SHR,DSN=SYS1.ISP.SISPCLIB         ISPF                       
//         DD DISP=SHR,DSN=SYS1.SCBDCLST             HCD                        
//SYSHELP  DD DISP=SHR,DSN=SYS1.HELP                 TSO                        
//ISPTLIB  DD DISP=SHR,DSN=SYS1.ISP.SISPTENU         ISPF                       
//         DD DISP=SHR,DSN=SYS1.ISF.SISFTLIB         SDSF                       
//ISPSLIB  DD DISP=SHR,DSN=SYS1.ISP.SISPSLIB         ISPF                       
//         DD DISP=SHR,DSN=SYS1.ISP.SISPSENU         ISPF                       
//ISPMLIB  DD DISP=SHR,DSN=SYS1.ISP.SISPMENU         ISPF                       
//         DD DISP=SHR,DSN=SYS1.ISF.SISFMLIB         SDSF                       
//ISPPLIB  DD DISP=SHR,DSN=SYS1.ISP.SISPPENU         ISPF                       
//         DD DISP=SHR,DSN=SYS1.ISF.SISFPLIB         SDSF                       
//SYSPRINT DD TERM=TS,SYSOUT=*                                                  
//SYSTERM  DD TERM=TS,SYSOUT=*                                                  
//SYSIN    DD TERM=TS                                                           
./ ADD NAME=JES2,LEVEL=00,SOURCE=0,LIST=ALL                                     
//JES2     PROC                                                                 
//IEFPROC  EXEC PGM=HASJES20,                                                   
//            DPRTY=(15,15),TIME=1440,PERFORM=9                                 
//ALTPARM  DD DISP=SHR,                                                         
//            DSN=SYS1.PARMLIB(JES2PARM)                                        
//HASPPARM DD DISP=SHR,                                                         
//            DSN=SYS1.PARMLIB(JES2PARM)                                        
//PROC00   DD DISP=SHR,                                                         
//            DSN=SYS1.PROCLIB                                                  
//         DD DISP=SHR,                                                         
//            DSN=SYS1.IBM.PROCLIB                                              
//HASPLIST DD DDNAME=IEFRDER                                                    
./ ADD NAME=LLA,LEVEL=00,SOURCE=0,LIST=ALL                                      
//LLA PROC LLA=                                                                 
//LLA EXEC PGM=CSVLLCRE,PARM='LLA=&LLA'                                         
./ ADD NAME=VLF,LEVEL=00,SOURCE=0,LIST=ALL                                      
//VLF      PROC  NN=00                                                          
//VLF      EXEC  PGM=COFMINIT,PARM='NN=&NN'                                     
./ ADD NAME=NET,LEVEL=00,SOURCE=0,LIST=ALL                                      
//NET    PROC                                                                   
//NET      EXEC PGM=ISTINM01,REGION=0M,                                         
//         DPRTY=(15,15),TIME=1440,PERFORM=8                                    
//VTAMLST  DD DISP=SHR,                                                         
//            DSN=SYS1.VTAMLST                                                  
//VTAMLIB  DD DISP=SHR,                                                         
//            DSN=SYS1.VTAMLIB                                                  
//SISTCLIB DD DISP=SHR,                                                         
//            DSN=SYS1.SISTCLIB                                                 
//SYSABEND DD SYSOUT=*,HOLD=YES                                                 
./ ADD NAME=SDSF,LEVEL=00,SOURCE=0,LIST=ALL                                     
//SDSF     PROC  M=00,         /* SUFFIX FOR ISFPRMXX */                        
//             P='LC(X)'       /* USE SYSOUT CLASS X FOR SDSFLOG */             
//SDSF     EXEC  PGM=ISFHCTL,REGION=32M,TIME=1440,PARM='M(&M),&P'               
./ ADD NAME=TSO,LEVEL=00,SOURCE=0,LIST=ALL                                      
//TSO    PROC MBR=TSOKEY00                                                      
//TSO    EXEC PGM=IKTCAS00,TIME=1440                                            
//PARMLIB DD DSN=SYS1.PARMLIB(&MBR),DISP=SHR,FREE=CLOSE                         
//PRINTOUT DD SYSOUT=*,FREE=CLOSE                                               
./ ENDUP                                                                        
@#                                                                              
//*****************************************************************             
//* UPDATE VTAMLST WITH REQUIRED MEMBERS                                        
//*****************************************************************             
//UVTAM17  EXEC PGM=IEBUPDTE,PARM=NEW,REGION=4M,COND=(0,NE)                     
//SYSUT2   DD  DSN=SYS1.VTAMLST,DISP=SHR,                                       
//             UNIT=SYSALLDA,VOL=SER=SYS1PK                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DATA,DLM=@#                                                      
./ ADD NAME=APTSO,LEVEL=00,SOURCE=0,LIST=ALL                                    
APTSO  VBUILD  TYPE=APPL                                                        
*                                                                               
A01TSO   APPL  AUTH=(NOACQ,NOBLOCK,PASS,NOTCAM,NVPACE,TSO,NOPO),       X        
               EAS=1,ACBNAME=TSO                                                
*                                                                               
A01TSO01 APPL  AUTH=(NOACQ,NOBLOCK,PASS,NOTCAM,NVPACE,TSO,NOPO),       X        
               EAS=1,ACBNAME=TSO0001                                            
A01TSO02 APPL  AUTH=(NOACQ,NOBLOCK,PASS,NOTCAM,NVPACE,TSO,NOPO),       X        
               EAS=1,ACBNAME=TSO0002                                            
A01TSO03 APPL  AUTH=(NOACQ,NOBLOCK,PASS,NOTCAM,NVPACE,TSO,NOPO),       X        
               EAS=1,ACBNAME=TSO0003                                            
A01TSO04 APPL  AUTH=(NOACQ,NOBLOCK,PASS,NOTCAM,NVPACE,TSO,NOPO),       X        
               EAS=1,ACBNAME=TSO0004                                            
A01TSO05 APPL  AUTH=(NOACQ,NOBLOCK,PASS,NOTCAM,NVPACE,TSO,NOPO),       X        
               EAS=1,ACBNAME=TSO0005                                            
A01TSO06 APPL  AUTH=(NOACQ,NOBLOCK,PASS,NOTCAM,NVPACE,TSO,NOPO),       X        
               EAS=1,ACBNAME=TSO0006                                            
A01TSO07 APPL  AUTH=(NOACQ,NOBLOCK,PASS,NOTCAM,NVPACE,TSO,NOPO),       X        
               EAS=1,ACBNAME=TSO0007                                            
A01TSO08 APPL  AUTH=(NOACQ,NOBLOCK,PASS,NOTCAM,NVPACE,TSO,NOPO),       X        
               EAS=1,ACBNAME=TSO0008                                            
A01TSO09 APPL  AUTH=(NOACQ,NOBLOCK,PASS,NOTCAM,NVPACE,TSO,NOPO),       X        
               EAS=1,ACBNAME=TSO0009                                            
A01TSO10 APPL  AUTH=(NOACQ,NOBLOCK,PASS,NOTCAM,NVPACE,TSO,NOPO),       X        
               EAS=1,ACBNAME=TSO0010                                            
./ ADD NAME=ATCCON00,LEVEL=00,SOURCE=0,LIST=ALL                                 
APTSO,LCL3270A                                                                  
./ ADD NAME=ATCSTR00,LEVEL=00,SOURCE=0,LIST=ALL                                 
SSCPID=01,                                                             X        
SSCPNAME=EMRG01,                                                       X        
NETID=USEMRG01,                                                        X        
CONFIG=00,                                                             X        
NOPROMPT,                                                              X        
MAXSUBA=31,                                                            X        
SUPP=NOSUP,                                                            X        
HOSTSA=1,                                                              X        
CRPLBUF=(208,,15,,1,16),                                               X        
IOBUF=(100,128,19,,1,20),                                              X        
LFBUF=(104,,0,,1,1),                                                   X        
LPBUF=(64,,0,,1,1),                                                    X        
SFBUF=(163,,0,,1,1)                                                             
./ ADD NAME=LCL3270A,LEVEL=00,SOURCE=0,LIST=ALL                                 
LCL3270A LBUILD                                                                 
*                                                                               
*  0120 IS MASTER CONSOLE                                                       
*LCL120   LOCAL CUADDR=0120,                                          X         
*               DLOGMOD=D4B32782,                                     X         
*               TERM=3277,                                            X         
*               FEATUR2=MODEL2,                                       X         
*               ISTATUS=ACTIVE,                                       X         
*               USSTAB=ISTINCDT                                                 
*                                                                               
LCL121   LOCAL CUADDR=0121,                                            X        
               DLOGMOD=D4B32782,                                       X        
               TERM=3277,                                              X        
               FEATUR2=MODEL2,                                         X        
               ISTATUS=ACTIVE,                                         X        
               USSTAB=ISTINCDT                                                  
*                                                                               
LCL122   LOCAL CUADDR=0122,                                            X        
               DLOGMOD=D4B32782,                                       X        
               TERM=3277,                                              X        
               FEATUR2=MODEL2,                                         X        
               ISTATUS=ACTIVE,                                         X        
               USSTAB=ISTINCDT                                                  
*                                                                               
LCL123   LOCAL CUADDR=0123,                                            X        
               DLOGMOD=D4B32782,                                       X        
               TERM=3277,                                              X        
               FEATUR2=MODEL2,                                         X        
               ISTATUS=ACTIVE,                                         X        
               USSTAB=ISTINCDT                                                  
*                                                                               
LCL124   LOCAL CUADDR=0124,                                            X        
               DLOGMOD=D4B32782,                                       X        
               TERM=3277,                                              X        
               FEATUR2=MODEL2,                                         X        
               ISTATUS=ACTIVE,                                         X        
               USSTAB=ISTINCDT                                                  
*                                                                               
LCL125   LOCAL CUADDR=0125,                                            X        
               DLOGMOD=D4B32782,                                       X        
               TERM=3277,                                              X        
               FEATUR2=MODEL2,                                         X        
               ISTATUS=ACTIVE,                                         X        
               USSTAB=ISTINCDT                                                  
*                                                                               
LCL126   LOCAL CUADDR=0126,                                            X        
               DLOGMOD=D4B32782,                                       X        
               TERM=3277,                                              X        
               FEATUR2=MODEL2,                                         X        
               ISTATUS=ACTIVE,                                         X        
               USSTAB=ISTINCDT                                                  
*                                                                               
LCL127   LOCAL CUADDR=0127,                                            X        
               DLOGMOD=D4B32782,                                       X        
               TERM=3277,                                              X        
               FEATUR2=MODEL2,                                         X        
               ISTATUS=ACTIVE,                                         X        
               USSTAB=ISTINCDT                                                  
*                                                                               
LCL128   LOCAL CUADDR=0128,                                            X        
               DLOGMOD=D4B32782,                                       X        
               TERM=3277,                                              X        
               FEATUR2=MODEL2,                                         X        
               ISTATUS=ACTIVE,                                         X        
               USSTAB=ISTINCDT                                                  
*                                                                               
LCL129   LOCAL CUADDR=0129,                                            X        
               DLOGMOD=D4B32782,                                       X        
               TERM=3277,                                              X        
               FEATUR2=MODEL2,                                         X        
               ISTATUS=ACTIVE,                                         X        
               USSTAB=ISTINCDT                                                  
*                                                                               
LCL12A   LOCAL CUADDR=012A,                                            X        
               DLOGMOD=D4B32782,                                       X        
               TERM=3277,                                              X        
               FEATUR2=MODEL2,                                         X        
               ISTATUS=ACTIVE,                                         X        
               USSTAB=ISTINCDT                                                  
*                                                                               
LCL12B   LOCAL CUADDR=012B,                                            X        
               DLOGMOD=D4B32782,                                       X        
               TERM=3277,                                              X        
               FEATUR2=MODEL2,                                         X        
               ISTATUS=ACTIVE,                                         X        
               USSTAB=ISTINCDT                                                  
*                                                                               
LCL12C   LOCAL CUADDR=012C,                                            X        
               DLOGMOD=D4B32782,                                       X        
               TERM=3277,                                              X        
               FEATUR2=MODEL2,                                         X        
               ISTATUS=ACTIVE,                                         X        
               USSTAB=ISTINCDT                                                  
*                                                                               
LCL12D   LOCAL CUADDR=012D,                                            X        
               DLOGMOD=D4B32782,                                       X        
               TERM=3277,                                              X        
               FEATUR2=MODEL2,                                         X        
               ISTATUS=ACTIVE,                                         X        
               USSTAB=ISTINCDT                                                  
*                                                                               
LCL12E   LOCAL CUADDR=012E,                                            X        
               DLOGMOD=D4B32782,                                       X        
               TERM=3277,                                              X        
               FEATUR2=MODEL2,                                         X        
               ISTATUS=ACTIVE,                                         X        
               USSTAB=ISTINCDT                                                  
*                                                                               
LCL12F   LOCAL CUADDR=012F,                                            X        
               DLOGMOD=D4B32782,                                       X        
               TERM=3277,                                              X        
               FEATUR2=MODEL2,                                         X        
               ISTATUS=ACTIVE,                                         X        
               USSTAB=ISTINCDT                                                  
./ ENDUP                                                                        
@#                                                                              
//*****************************************************************             
//* UPDATE SISPCLIB WITH REQUIRED MEMBERS                                       
//*****************************************************************             
//UCLIST18 EXEC PGM=IEBUPDTE,PARM=NEW,REGION=4M,COND=(0,NE)                     
//SYSUT2   DD  DSN=SYS1.ISP.SISPCLIB,DISP=SHR,                                  
//             UNIT=SYSALLDA,VOL=SER=SYS1PK                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DATA,DLM=@#                                                      
./ ADD NAME=LOGPROF,LEVEL=00,SOURCE=0,LIST=ALL                                  
CONTROL NOLIST NOFLUSH NOMSG                                                    
SET &DSNAME = &SYSUID..ISPPROF                                                  
ALLOC FI(ISPPROF) SHR  DA('&DSNAME.')                                           
 IF &LASTCC ^= 0 THEN +                                                         
  DO                                                                            
    FREE FI(ISPCRTE)                                                            
    CONTROL MSG                                                                 
    ATTRIB ISPCRTE DSORG(PO) RECFM(F B) LRECL(80) BLKSIZE(3120)                 
    ALLOC DA('&DSNAME.') SP(2,1) TRACKS DIR(2) USING(ISPCRTE) +                 
        UNIT(SYSALLDA) FI(ISPPROF)                                              
    IF &LASTCC = 0 THEN +                                                       
      WRITE *** ISPF PROFILE DATA SET '&DSNAME.' HAS BEEN CREATED               
    ELSE +                                                                      
     DO                                                                         
      WRITE  *** UNABLE TO ALLOCATE ISPF PROFILE DATA SET '&DSNAME.'            
      FREE FI(ISPCRTE)                                                          
      EXIT CODE(12)                                                             
    END                                                                         
 END                                                                            
ISPF                                                                            
./ ENDUP                                                                        
@#                                                                              
//*****************************************************************             
//* UPDATE SISPPENU WITH REQUIRED MEMBERS                                       
//*****************************************************************             
//UPANEL19 EXEC PGM=IEBUPDTE,PARM=NEW,REGION=4M,COND=(0,NE)                     
//SYSUT2   DD  DSN=SYS1.ISP.SISPPENU,DISP=SHR,                                  
//             UNIT=SYSALLDA,VOL=SER=SYS1PK                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DATA,DLM=@#                                                      
./ ADD NAME=ISR@PRIM,LEVEL=00,SOURCE=0,LIST=ALL                                 
)PANEL KEYLIST(ISRSAB,ISR) IMAGE(&ZIMGNAM,&ZIMGROW,&ZIMGCOL)                    
)ATTR DEFAULT() FORMAT(MIX)            /* ISR@PRIM - ENGLISH - 5.2 */        
 0B TYPE(AB)                                                                    
 0D TYPE(PS)                                                                    
 04 TYPE(ABSL) GE(ON)                                                           
 05 TYPE(PT)                                                                    
 09 TYPE(FP)                                                                    
 0A TYPE(NT)                                                                    
 11 TYPE(SAC)                                                                   
 16 TYPE(VOI) PADC(USER)                                                        
 2B TYPE(DT)                                                                    
 22 TYPE(WASL) SKIP(ON) GE(ON)                                                  
 26 TYPE(NEF) CAPS(ON) PADC(USER)                                               
 27 AREA(SCRL) EXTEND(ON)                                                       
 28 TYPE(PS) CSRGRP(99)                                                         
 29 TYPE(GRPBOX)                                                                
 2A AREA(DYNAMIC)                                                               
 19 TYPE(DATAOUT) COLOR(WHITE)                                                  
 1A TYPE(DATAOUT) COLOR(RED)                                                    
 1B TYPE(DATAOUT) COLOR(BLUE)                                                   
 1C TYPE(DATAOUT) COLOR(GREEN)                                                  
 1D TYPE(DATAOUT) COLOR(PINK)                                                   
 1E TYPE(DATAOUT) COLOR(YELLOW)                                                 
 1F TYPE(DATAOUT) COLOR(TURQ)                                                   
 30 TYPE(DATAOUT) PAS(ON)                                                       
 31 TYPE(CHAR) COLOR(WHITE)                                                     
 32 TYPE(CHAR) COLOR(RED)                                                       
 33 TYPE(CHAR) COLOR(BLUE)                                                      
 34 TYPE(CHAR) COLOR(GREEN)                                                     
 35 TYPE(CHAR) COLOR(PINK)                                                      
 36 TYPE(CHAR) COLOR(YELLOW)                                                    
 37 TYPE(CHAR) COLOR(TURQ)                                                      
 38 TYPE(DATAOUT) CUADYN(VOI)                                                   
 39 TYPE(CHAR) COLOR(WHITE) HILITE(REVERSE)                                     
 3A TYPE(CHAR) COLOR(RED) HILITE(REVERSE)                                       
 3B TYPE(CHAR) COLOR(BLUE) HILITE(REVERSE)                                      
 3C TYPE(CHAR) COLOR(GREEN) HILITE(REVERSE)                                     
 3D TYPE(CHAR) COLOR(PINK) HILITE(REVERSE)                                      
 3E TYPE(CHAR) COLOR(YELLOW) HILITE(REVERSE)                                    
 3F TYPE(CHAR) COLOR(TURQ) HILITE(REVERSE)                                      
)ABC DESC('Menu') MNEM(1)                                                       
PDC DESC('Settings') UNAVAIL(ZPM1) MNEM(1) ACC(CTRL+S)                          
 ACTION RUN(ISRROUTE) PARM('SET')                                               
PDC DESC('View') UNAVAIL(ZPM2) MNEM(1) ACC(CTRL+V)                              
 ACTION RUN(ISRROUTE) PARM('BR1')                                               
PDC DESC('Edit') UNAVAIL(ZPM3) MNEM(1) ACC(CTRL+E)                              
 ACTION RUN(ISRROUTE) PARM('ED1')                                               
PDC DESC('ISPF Command Shell') UNAVAIL(ZPM4) MNEM(6) ACC(CTRL+C)                
 ACTION RUN(ISRROUTE) PARM('C1')                                                
PDC DESC('Dialog Test...') UNAVAIL(ZPM5) MNEM(8) ACC(CTRL+T)                    
 ACTION RUN(ISRROUTE) PARM('DAL')                                               
PDC DESC('Other IBM Products...') UNAVAIL(ZPM6) MNEM(1) ACC(CTRL+O)             
 ACTION RUN(ISRROUTE) PARM('OIB')                                               
PDC DESC('SCLM') UNAVAIL(ZPM7) MNEM(3) ACC(CTRL+L)                              
 ACTION RUN(ISRROUTE) PARM('SCL')                                               
PDC DESC('ISPF Workplace') UNAVAIL(ZPM8) MNEM(6) ACC(CTRL+W)                    
 ACTION RUN(ISRROUTE) PARM('WRK')                                               
PDC DESC('Status Area...') UNAVAIL(ZPMS) MNEM(8) ACC(CTRL+A)                    
 ACTION RUN(ISRROUTE) PARM('SAM')                                               
PDC DESC('Exit') MNEM(2) PDSEP(ON) ACC(CTRL+X) ACTION RUN(EXIT)                 
)ABCINIT                                                                        
.ZVARS=ISR@OPT                                                                  
)ABC DESC('Utilities') MNEM(1)                                                  
PDC DESC('Library') UNAVAIL(ZUT1) MNEM(1) ACC(ALT+1)                            
 ACTION RUN(ISRROUTE) PARM('U1')                                                
PDC DESC('Data set') UNAVAIL(ZUT2) MNEM(1) ACC(ALT+2)                           
 ACTION RUN(ISRROUTE) PARM('U2')                                                
PDC DESC('Move/Copy') UNAVAIL(ZUT3) MNEM(1) ACC(ALT+3)                          
 ACTION RUN(ISRROUTE) PARM('U3')                                                
PDC DESC('Data Set List') UNAVAIL(ZUT4) MNEM(2) ACC(ALT+4)                      
 ACTION RUN(ISRROUTE) PARM('U4')                                                
PDC DESC('Reset Statistics') UNAVAIL(ZUT5) MNEM(5) ACC(ALT+5)                   
 ACTION RUN(ISRROUTE) PARM('U5')                                                
PDC DESC('Hardcopy') UNAVAIL(ZUT6) MNEM(1) ACC(ALT+6)                           
 ACTION RUN(ISRROUTE) PARM('U6')                                                
PDC DESC('Download...') UNAVAIL(ZUTDT) MNEM(2) ACC(ALT+7)                       
 ACTION RUN(ISRROUTE) PARM('UDT')                                               
PDC DESC('Outlist') UNAVAIL(ZUT7) MNEM(2) ACC(ALT+8)                            
 ACTION RUN(ISRROUTE) PARM('U8')                                                
PDC DESC('Commands...') UNAVAIL(ZUT8) MNEM(1) ACC(ALT+9)                        
 ACTION RUN(ISRROUTE) PARM('U9')                                                
PDC DESC('Reserved') UNAVAIL(ZUT9) MNEM(6) ACTION RUN(ISRROUTE) PARM('U10')     
PDC DESC('Format') UNAVAIL(ZUT10) MNEM(1) ACC(ALT+F1)                           
 ACTION RUN(ISRROUTE) PARM('U11')                                               
PDC DESC('SuperC') UNAVAIL(ZUT11) MNEM(1) PDSEP(ON) ACC(CTRL+F2)                
 ACTION RUN(ISRROUTE) PARM('U12')                                               
PDC DESC('SuperCE') UNAVAIL(ZUT12) MNEM(3) ACC(CTRL+F3)                         
 ACTION RUN(ISRROUTE) PARM('U13')                                               
PDC DESC('Search-For') UNAVAIL(ZUT13) MNEM(2) ACC(CTRL+F4)                      
 ACTION RUN(ISRROUTE) PARM('U14')                                               
PDC DESC('Search-ForE') UNAVAIL(ZUT14) MNEM(4) ACC(CTRL+F5)                     
 ACTION RUN(ISRROUTE) PARM('U15')                                               
)ABCINIT                                                                        
.ZVARS=PDFUTIL                                                                  
     &zut9 = '1'                                                                
)ABC DESC('Compilers') MNEM(1)                                                  
PDC DESC('Foreground Compilers') MNEM(1) ACTION RUN(ISRROUTE) PARM('FGD')       
PDC DESC('Background Compilers') MNEM(1) ACTION RUN(ISRROUTE) PARM('BKG')       
PDC DESC('ISPPREP Panel Utility...') MNEM(1) ACTION RUN(ISPPREP)                
PDC DESC('DTL Compiler...') MNEM(1) ACTION RUN(ISPDTLC)                         
)ABCINIT                                                                        
.ZVARS=ISRLANG                                                                  
)ABC DESC('Options') MNEM(1)                                                    
PDC DESC('General Settings') MNEM(1) ACTION RUN(ISRROUTE) PARM('SET')           
PDC DESC('CUA Attributes...') MNEM(1) ACTION RUN(CUAATTR)                       
PDC DESC('Keylists...') MNEM(1) ACTION RUN(KEYLIST)                             
PDC DESC('Point-and-Shoot...') MNEM(1) ACTION RUN(PSCOLOR)                      
PDC DESC('Colors...') MNEM(2) ACTION RUN(COLOR)                                 
PDC DESC('Dialog Test appl ID...') MNEM(1) ACTION RUN(ISRROUTE) PARM('DAP')     
)ABCINIT                                                                        
.ZVARS=PDFOPTM                                                                  
)ABC DESC('Status') MNEM(1)                                                     
PDC DESC('Session') UNAVAIL(ZCSTA) MNEM(1) ACTION RUN(ISRROUTE) PARM('SES')     
PDC DESC('Function keys') UNAVAIL(ZCSTB) MNEM(1)                                
 ACTION RUN(ISRROUTE) PARM('FUN')                                               
PDC DESC('Calendar') UNAVAIL(ZCSTC) MNEM(1) ACTION RUN(ISRROUTE) PARM('CAL')    
PDC DESC('User status') UNAVAIL(ZCSTD) MNEM(1) ACTION RUN(ISRROUTE) PARM('USE') 
PDC DESC('User point and shoot') UNAVAIL(ZCSTE) MNEM(3)                         
 ACTION RUN(ISRROUTE) PARM('UPS')                                               
PDC DESC('None') UNAVAIL(ZCSTF) MNEM(1) ACTION RUN(ISRROUTE) PARM('OFF')        
)ABCINIT                                                                        
.ZVARS=PDFSTA                                                                   
IF (&ZSCREEN = '1')                                                             
  VGET (ZSAREA1)                                                                
  &ZSAREA = &ZSAREA1                                                            
  GOTO A                                                                        
IF (&ZSCREEN = '2')                                                             
  VGET (ZSAREA2)                                                                
  &ZSAREA = &ZSAREA2                                                            
  GOTO A                                                                        
IF (&ZSCREEN = '3')                                                             
  VGET (ZSAREA3)                                                                
  &ZSAREA = &ZSAREA3                                                            
  GOTO A                                                                        
IF (&ZSCREEN = '4')                                                             
  VGET (ZSAREA4)                                                                
  &ZSAREA = &ZSAREA4                                                            
  GOTO A                                                                        
ELSE                                                                            
  VGET (ZSAREA5)                                                                
  &ZSAREA = &ZSAREA5                                                            
A:                                                                              
&zcsta = 0                                                                      
&zcstb = 0                                                                      
&zcstc = 0                                                                      
&zcstd = 0                                                                      
&zcste = 0                                                                      
&zcstf = 0                                                                      
IF (&ZSAREA = 'SES') &zcsta = 1                                                 
IF (&ZSAREA = 'FUN') &zcstb = 1                                                 
IF (&ZSAREA = 'CAL') &zcstc = 1                                                 
IF (&ZSAREA = 'USE') &zcstd = 1                                                 
IF (&ZSAREA = 'UPS') &zcste = 1                                                 
IF (&ZSAREA = 'OFF') &zcstf = 1                                                 
&PDFSTA = ' '                                                                   
)ABC DESC('Help') MNEM(1)                                                       
PDC DESC('General') MNEM(1) ACTION RUN(TUTOR) PARM('ISR01000')                  
PDC DESC('Settings') MNEM(1) ACTION RUN(TUTOR) PARM('ISP05000')                 
PDC DESC('View') MNEM(1) ACTION RUN(TUTOR) PARM('ISR10000')                     
PDC DESC('Edit') MNEM(1) ACTION RUN(TUTOR) PARM('ISR20000')                     
PDC DESC('Utilities') MNEM(1) ACTION RUN(TUTOR) PARM('ISR30000')                
PDC DESC('Foreground') MNEM(1) ACTION RUN(TUTOR) PARM('ISR40000')               
PDC DESC('Batch') MNEM(1) ACTION RUN(TUTOR) PARM('ISR50000')                    
PDC DESC('Command') MNEM(1) ACTION RUN(TUTOR) PARM('ISR60010')                  
PDC DESC('Dialog Test') MNEM(1) ACTION RUN(TUTOR) PARM('ISP70000')              
PDC DESC('LM Facility') MNEM(1) ACTION RUN(TUTOR) PARM('ISR80000')              
PDC DESC('IBM Products') MNEM(1) ACTION RUN(TUTOR) PARM('ISRD0000')             
PDC DESC('SCLM') MNEM(4) ACTION RUN(TUTOR) PARM('FLMTD')                        
PDC DESC('Workplace') MNEM(1) ACTION RUN(TUTOR) PARM('ISR00400')                
PDC DESC('Exit') MNEM(2) ACTION RUN(TUTOR) PARM('ISP90100')                     
PDC DESC('Status Area') MNEM(2) ACTION RUN(TUTOR) PARM('ISPSAMHP')              
PDC DESC('About...') MNEM(1) ACTION RUN(TUTOR) PARM('ISR@LOGO')                 
PDC DESC('Changes for this Release') MNEM(2) ACTION RUN(TUTOR) PARM('ISR00005') 
PDC DESC('Tutorial') MNEM(4) ACTION RUN(TUTOR) PARM('ISR00000')                 
PDC DESC('Appendices') MNEM(2) ACTION RUN(TUTOR) PARM('ISR00004')               
PDC DESC('Index') MNEM(2) ACTION RUN(TUTOR) PARM('ISR91000')                    
)ABCINIT                                                                        
.ZVARS=PRIMHELP                                                                 
)BODY  CMD(ZCMD)                                                                
 Menu Utilities Compilers Options Status Help                           
------------------------------------------------------------------------------ 
                          	ISPF Primary Option Menu                          
Option ===>Z                                                                 
SAREA39                                               GRPBOX1                
                                                      TMPROWS,TMPSHDW     
                                                                          
                                                                          
                                                                          
                                                                          
                                                                          
                                                                          
                                                                          
                                                                          
                                                                          
                                                                          
                                                                          
                                                                              
ZEXI                                                                        
    EnterZto Terminate using log/list defaults                             
)AREA SAREA39                                                                   
0 Settings     Terminal and user parameters                                 
1 View         Display source data or listings                              
2 Edit         Create or change source data                                 
3 Utilities    Perform utility functions                                    
4 Foreground   Interactive language processing                              
5 Batch        Submit job for language processing                           
6 Command      Enter TSO or Workstation commands                            
7 Dialog Test  Perform dialog testing                                       
9 IBM Products IBM program development products                             
10SCLM         SW Configuration Library Manager                             
11Workplace    ISPF Object/Action Workplace                                 
S SDSF         System Display and Search Facility                           
H HCD          Hardware Configuration Definition                            
)INIT                                                                           
.ZVARS = '(ZCMD ZEXX)'                                                          
.HELP = ISR00003                                                                
&ZPRIM = YES                                                                    
&ZEXX = 'X'                                                                     
&ZEXI = ' '                                                                     
.CURSOR = ZCMD                                                                  
&TMPROWS = &ZSDATA                                                              
&TMPSHDW = &ZSSHDW                                                              
IF (&ZHILITE = YES OR &ZGUI ^= &Z)                                              
  .ATTRCHAR(19)='PAS(ON) COLOR(WHITE)'                                          
  .ATTRCHAR(1A)='PAS(ON) COLOR(RED)'                                            
  .ATTRCHAR(1B)='PAS(ON) COLOR(BLUE)'                                           
  .ATTRCHAR(1C)='PAS(ON) COLOR(GREEN)'                                          
  .ATTRCHAR(1D)='PAS(ON) COLOR(PINK)'                                           
  .ATTRCHAR(1E)='PAS(ON) COLOR(YELLOW)'                                         
  .ATTRCHAR(1F)='PAS(ON) COLOR(TURQ)'                                           
IF (&ZGUI ^= &Z)                                                                
  &ZPASICON = 'ON'                                                              
  &ZPASTEXT = 'OFF'                                                             
  IF (&ZSCREEN = '1')                                                           
    VGET (ZSAREA1)                                                              
    &ZSAREA = &ZSAREA1                                                          
    GOTO A                                                                      
  IF (&ZSCREEN = '2')                                                           
    VGET (ZSAREA2)                                                              
    &ZSAREA = &ZSAREA2                                                          
    GOTO A                                                                      
  IF (&ZSCREEN = '3')                                                           
    VGET (ZSAREA3)                                                              
    &ZSAREA = &ZSAREA3                                                          
    GOTO A                                                                      
  IF (&ZSCREEN = '4')                                                           
    VGET (ZSAREA4)                                                              
    &ZSAREA = &ZSAREA4                                                          
    GOTO A                                                                      
  ELSE                                                                          
    VGET (ZSAREA5)                                                              
    &ZSAREA = &ZSAREA5                                                          
  A:                                                                            
  &zcstf = 0                   /* initialize Status AB unavail flags */         
  IF (&ZSAREA = 'OFF') &zcstf = 1                                               
ELSE                                                                            
  &ZPASICON = 'OFF'                                                             
  &ZPASTEXT = 'ON'                                                              
VGET (ZSCML ZSCBR ZSCED ZTAPPLID) PROFILE /*   @V6A*/                           
IF (&ZSCML = ' ') &ZSCML = 'PAGE'        /*                      @V6A */        
IF (&ZSCBR  = ' ') &ZSCBR = 'PAGE'       /*                      @V6A */        
IF (&ZSCED  = ' ') &ZSCED = 'PAGE'       /*                      @V6A */        
IF (&ZTAPPLID = ' ') &ZTAPPLID = 'ISR'                                          
VPUT (ZSCML ZSCBR ZSCED ZTAPPLID) PROFILE /*   @V6A*/                           
&ZHTOP = ISR00003   /* TUTORIAL TABLE OF CONTENTS        */                     
&ZHINDEX = ISR91000 /* TUTORIAL INDEX - 1ST PAGE         */                     
&ZSCLMPRJ = &Z      /* TUTORIAL INDEX - 1ST PAGE     @L1A*/                     
IF (&ZLOGO = 'YES')                                     /* CK@MJC*/             
  IF (&ZSPLIT = 'NO')      /* Not in split screen            @L5A*/             
    IF (&ZCMD = &Z)        /* No command pending             @L5A*/             
      IF (&ZLOGOPAN ^= 'DONE') /* No logo displayed yet      @L5A*/             
        .MSG = ISRLO999    /* Set logo information           @L5A*/             
        .RESP = ENTER      /* Simulate enter                 @L5A*/             
        &ZLOGOPAN = 'DONE' /*                                @L5A*/             
        &ZCLEAN = 'NO'     /*                                @L5A*/             
    IF (&ZCMD ^= &Z) &ZLOGOPAN = 'DONE'   /* command pending @L5A*/             
    VPUT (ZLOGOPAN) SHARED /*                                @L5A*/             
  IF (&ZSPLIT = 'YES') &ZLOGOPAN = 'DONE'                                       
VPUT (ZHTOP,ZHINDEX,ZSCLMPRJ) PROFILE                                           
IF (&ZCSTF = 1)   /* Status area = None */                                      
  &ZIMGNAM ='ISPFGIFL'                                                          
  &ZIMGROW =3                                                                   
ELSE                                                                            
  &ZIMGNAM ='ISPFGIFS'                                                          
  &ZIMGROW =15                                                                  
&ZIMGCOL =56                                                                    
&GRPBOX1 = ''                                                                   
IF (&ZCSTF='0') .ATTR(GRPBOX1) = 'WIDTH(22) DEPTH(13)'                          
ELSE .ATTR(GRPBOX1) = 'WIDTH(0)'                                                
.ATTR(ZEXI)='PADC(NULLS) PAS(&ZPASICON) CSRGRP(99)'                             
.ATTR(ZEXX)='PAS(&ZPASTEXT) CSRGRP(99)'                                         
)REINIT                                                                         
.CURSOR = ZCMD                                                                  
VGET (ZTAPPLID) PROFILE       /*                 Z41@MEA*/                      
IF (&ZTAPPLID = ' ') &ZTAPPLID = 'ISR'        /* Z41@MEA*/                      
)PROC                                                                           
IF (&ZCSTF='1') .ATTR(GRPBOX1) = 'WIDTH(0)'                                     
IF (.CURSOR = TMPROWS AND &ZCMD = ' ')                                          
 &ZSAR  =TRANS(&ZSCREEN 1,&ZSAREA1 2,&ZSAREA2 3,&ZSAREA3 4,&ZSAREA4 *,&ZSAREA5) 
 IF (&ZSAR = 'CAL','UPS','SES') &ZCMD = 'SP'                                    
&ZCMDWRK = TRUNC(&ZCMD,'.')                                                     
&ZTRAIL=.TRAIL                                                                  
&ZSEL = TRANS (TRUNC (&ZCMD,'.')                                                
  0,'PGM(ISPISM) SCRNAME(SETTINGS)'                                             
  1,'PGM(ISRBRO) PARM(ISRBRO01) SCRNAME(VIEW)'                                  
  2,'PGM(ISREDIT) PARM(P,ISREDM01) SCRNAME(EDIT)'                               
  3,'PANEL(ISRUTIL) SCRNAME(UTIL)'                                              
  4,'PANEL(ISRFPA) SCRNAME(FOREGRND)'                                           
  5,'PGM(ISRJB1) PARM(ISRJPA) SCRNAME(BATCH) NOCHECK'                           
  6,'PGM(ISRPTC) SCRNAME(CMD)'                                                  
  7,'PGM(ISPYXDR) PARM(&ZTAPPLID) SCRNAME(DTEST) NOCHECK'                       
  9,'PANEL(ISRDIIS) ADDPOP'                                                     
 10,'PGM(ISRSCLM) SCRNAME(SCLM) NOCHECK'                                        
 11,'PGM(ISRUDA) PARM(ISRWORK) SCRNAME(WORK)'                                   
  S,'PANEL(ISFSDOP2) NEWAPPL(ISF) &SCRNM'                                       
 SD,'PANEL(ISFSDOP2) NEWAPPL(ISF) &SCRNM'                                       
 SDSF,'PANEL(ISFSDOP2) NEWAPPL(ISF) &SCRNM'                                     
  H,'CMD(%CBDCHCD) NEWAPPL(CBD) PASSLIB'                                        
 HC,'CMD(%CBDCHCD) NEWAPPL(CBD) PASSLIB'                                        
 HCD,'CMD(%CBDCHCD) NEWAPPL(CBD) PASSLIB'                                       
  X,EXIT                                                                        
 SP,'PGM(ISPSAM) PARM(PNS)'                                                     
 ' ',' '                                                                        
   *,'?')                                                                       
IF (&ZCMD = 'S')                                                                
   &ZSEL = 'PGM(ISFISP) NOCHECK NEWAPPL(ISF) &SCRNM'                            
IF (&ZCMD = 'S.')                                                               
   &ZSEL = 'PGM(ISFISP) NOCHECK NEWAPPL(ISF) &SCRNM'                            
IF (&ZCMD = 'SD')                                                               
   &ZSEL = 'PGM(ISFISP) NOCHECK NEWAPPL(ISF) &SCRNM'                            
IF (&ZCMD = 'SD.')                                                              
   &ZSEL = 'PGM(ISFISP) NOCHECK NEWAPPL(ISF) &SCRNM'                            
IF (&ZCMD = 'SDSF')                                                             
   &ZSEL = 'PGM(ISFISP) NOCHECK NEWAPPL(ISF) &SCRNM'                            
IF (&ZCMD = 'SDSF.')                                                            
   &ZSEL = 'PGM(ISFISP) NOCHECK NEWAPPL(ISF) &SCRNM'                            
&ZTRAIL=.TRAIL                                                                  
)PNTS                                                                           
FIELD(ZPS01001) VAR(ZCMD) VAL(0)                                                
FIELD(ZPS01002) VAR(ZCMD) VAL(1)                                                
FIELD(ZPS01003) VAR(ZCMD) VAL(2)                                                
FIELD(ZPS01004) VAR(ZCMD) VAL(3)                                                
FIELD(ZPS01005) VAR(ZCMD) VAL(4)                                                
FIELD(ZPS01006) VAR(ZCMD) VAL(5)                                                
FIELD(ZPS01007) VAR(ZCMD) VAL(6)                                                
FIELD(ZPS01008) VAR(ZCMD) VAL(7)                                                
FIELD(ZPS01009) VAR(ZCMD) VAL(9)                                                
FIELD(ZPS01010) VAR(ZCMD) VAL(10)                                               
FIELD(ZPS01011) VAR(ZCMD) VAL(11)                                               
FIELD(ZPS01012) VAR(ZCMD) VAL(S)                                                
FIELD(ZPS01013) VAR(ZCMD) VAL(H)                                                
FIELD(ZEXI) VAR(ZCMD) VAL(X) DEPTH(2) IMAGE(ISPEXIT) PLACE(L)                   
FIELD(ZEXX) VAR(ZCMD) VAL(X)                                                    
)END                                                                            
/* 5694-A01 (C) COPYRIGHT IBM CORP 1982, 2001 */                                
/* ISPDTLC Release: 5.2.  Level: PID                                  */        
/* z/OS 01.02.00.  Created - Date: 10 Mar 2001, Time: 14:17           */        
./ ENDUP                                                                        
@#                                                                              
//*****************************************************************             
//* LIST THE SYS1PK MASTER CATALOG                                              
//*****************************************************************             
//LIST20 EXEC  PGM=IDCAMS,REGION=4M,COND=(0,NE)                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
     LISTC CATALOG(SYS1.MCAT.VSYS1PK) ALL                                       
/*                                                                              
//*****************************************************************             
//* CLEANUP - REMOVE SSA AND EXPORT DISCONNECT SYS1PK MCAT                      
//*****************************************************************             
//CLEAN21 EXEC  PGM=IDCAMS,REGION=4M,COND=(0,NE)                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
    DEL TARGSYS ALIAS                                                           
    EXP SYS1.MCAT.VSYS1PK DISCONNECT                                            
/*                                                                              
